Repository: kenzok8/small-package
Catalog: luci-app-internet-detector/luci-app-internet-detector/po/*/internet-detector.po
Languages: ru

source: <abbr title="Light Emitting Diode">LED</abbr> Name
ru: Имя <abbr title="Светодиод">LED</abbr>

source: <abbr title="Light Emitting Diode">LED</abbr> control
ru: Управление <abbr title="Светодиод">LED</abbr>

source: <abbr title="Light Emitting Diode">LED</abbr> indicates the Internet status.
ru: <abbr title="Светодиод">LED</abbr> отображает статус Интернет.

source: <abbr title="Light Emitting Diode">LED</abbr> mode
ru: Режим <abbr title="Светодиод">LED</abbr>

source: <abbr title="Light Emitting Diode">LED</abbr> will display the link activity of this network device.
ru: <abbr title="Светодиод">LED</abbr> будет отображать активность линка этого сетевого устройства.

source: Add instance
ru: Добавить экземпляр

source: After connection
ru: После подключения

source: After disconnection
ru: После отключения

source: Alive interval
ru: Интервал при подключении

source: Alive period
ru: Период после подключения

source: An email will be sent when connected or disconnected from the Internet.
ru: Сообщение будет отправлено на email при подключении или отключении от Интернет.

source: An error has occurred
ru: Произошла ошибка

source: Attempt interval
ru: Интервал попыток

source: Attempts
ru: Попытки

source: Big: 248 bytes
ru: Большой: 248 байт

source: Blinking (kernel: timer)
ru: Мигание (kernel: timer)

source: Bot API token is missing!
ru: Отсутствует API токен бота!

source: Bot token
ru: Токен бота

source: Check type
ru: Тип проверки

source: Checking Internet availability.
ru: Проверка доступности Интернет.

source: Checking the real public IP address.
ru: Проверка реального публичного IP адреса.

source: Command failed
ru: Команда не выполнена

source: Connected
ru: Подключен

source: Connection attempts
ru: Попытки подключения

source: Connection timeout
ru: Таймаут соединения

source: Contents have been saved.
ru: Содержимое сохранено.

source: Curl is not available...
ru: Curl недоступен...

source: Dead interval
ru: Интервал при отключении

source: Dead period
ru: Период после отключения

source: Debug
ru: Отладка

source: Default port value for TCP connections.
ru: Стандартное значение порта для TCP-подключений.

source: Device
ru: Устройство

source: Device will be rebooted when the Internet is disconnected.
ru: Устройство будет перезагружено при отключении Интернет.

source: Disable forced reboot
ru: Отключить принудительную перезагрузку

source: Disabled
ru: Отключен

source: Disabled: detector is completely off.
ru: Отключен: детектор полностью выключен.

source: Disconnected
ru: Отключен

source: Dismiss
ru: Закрыть

source: DNS query type
ru: Тип DNS-запроса

source: Edit
ru: Изменить

source: Edit down-script
ru: Изменить down-script

source: Edit regular-script
ru: Изменить regular-script

source: Edit public-ip-script
ru: Изменить public-ip-script

source: Edit up-script
ru: Изменить up-script

source: Email notification
ru: Уведомление по email

source: Email address of the recipient.
ru: Email-адрес получателя.

source: Email address of the sender.
ru: Email-адрес отправителя.

source: Enable
ru: Включить

source: Enable public-ip-script
ru: Включить public-ip-script

source: Enabled
ru: Включен

source: Error
ru: Ошибка

source: Expecting:
ru: Ожидается:

source: Failed interval
ru: Интервал при неудаче

source: Failed to get %s init status: %s
ru: Не удалось получить статус инициализации %s: %s

source: Forced reboot delay
ru: Задержка принудительной перезагрузки

source: Host alias
ru: Псевдоним хоста

source: Host availability check type.
ru: Тип проверки доступности хоста.

source: Host identifier in messages. If not specified, hostname will be used.
ru: Идентификатор хоста в сообщениях. Если не указан, будет использовано имя хоста.

source: Hostname/IP address of the SMTP server.
ru: Имя хоста/IP-адрес SMTP-сервера.

source: Hosts
ru: Хосты

source: Hosts polling interval when the Internet is down.
ru: Интервал опроса хостов если Интернет недоступен.

source: Hosts polling interval when the Internet is up.
ru: Интервал опроса хостов если Интернет доступен.

source: Hosts to check Internet availability. Hosts are polled (in list order) until at least one of them responds.
ru: Хосты для проверки доступности Интернет. Хосты опрашиваются (в порядке списка) до тех пор, пока хотя бы один из них не ответит.

source: Huge: 1492 bytes
ru: Огромный: 1492 байта

source: ID of the Telegram chat to which messages will be sent.
ru: ID чата Telegram в который будут отправлены сообщения.

source: ICMP-echo request (ping)
ru: Запрос ICMP-echo (ping)

source: ICMP packet data size
ru: Размер данных ICMP-пакета

source: Incorrect bot token?
ru: Неправильный токен бота?

source: Info
ru: Информация

source: Instances
ru: Экземпляры

source: Interface
ru: Интерфейс

source: Interface timeout
ru: Таймаут интерфейса

source: Internet
ru: Интернет

source: Internet Detector
ru: Интернет-детектор

source: Internet detector mode
ru: Режим интернет-детектора

source: Internet status
ru: Статус Интернет

source: Interval between IP address requests.
ru: Интервал между запросами IP адреса.

source: Interval between IP address requests if the IP address is not defined.
ru: Интервал между запросами IP адреса, если IP адрес не определён.

source: Interval between modem restarts.
ru: Интервал между перезапусками модема.

source: Interval between network restarts.
ru: Интервал между перезапусками сети.

source: Interval between down-script runs.
ru: Интервал между запусками down-script.

source: Interval between up-script runs.
ru: Интервал между запусками up-script.

source: Jumbo: 9000 bytes
ru: Гигантский: 9000 байт

source: LED control
ru: Управление LED

source: Link On
ru: Подключение

source: Loading
ru: Загрузка

source: Log event level.
ru: Уровень событий лога.

source: Logging
ru: Запись событий в лог

source: Mailsend is not available...
ru: Mailsend недоступен...

source: Main settings
ru: Основные настройки

source: Maximum number of attempts to connect to each host.
ru: Максимальное количество попыток подключения к каждому хосту.

source: Maximum number of network restart attempts before Internet access is available.
ru: Максимальное количество попыток перезапуска сети до появления доступа в Интренет.

source: Maximum number of up-script run attempts when connected to the Internet.
ru: Максимальное количество попыток запуска up-script при подключении к Интренет.

source: Maximum number of down-script run attempts before Internet access is available.
ru: Максимальное количество попыток запуска down-script до появления доступа в Интренет.

source: Maximum timeout for waiting for a response from the host.
ru: Максимальный таймаут ожидания ответа от хоста.

source: ModemManager is not available...
ru: ModemManager недоступен...

source: Modem will be restarted when the Internet is disconnected.
ru: Модем будет перезапущен при отключении Интернет.

source: ModemManger interface. If specified, it will be restarted after restarting ModemManager.
ru: Интерфейс ModemManager. Если задан, то будет перезапущен после перезапуска ModemManger.

source: Network device for Internet access. If not specified, the default device is used.
ru: Сетевое устройство для доступа в Интернет. Если не указано, используется устройство по умолчанию.

source: Network device activity (kernel: netdev)
ru: Активность сетевого устройства (kernel: netdev)

source: Network device or interface to restart. If not specified, then the network service is restarted.
ru: Сетевое устройство или интерфейс для перезапуска. Если не задано, то будет перезапущена сетевая служба.

source: Network will be restarted when the Internet is disconnected.
ru: Сеть будет перезапущена при отключении Интернет.

source: Next run
ru: Следующий запуск

source: No <abbr title="Light Emitting Diode">LED</abbr>s available...
ru: Нет доступных <abbr title="Светодиод">LED</abbr>...

source: No messages available. Write something to the bot and try again.
ru: Нет доступных сообщений. Напишите что-нибудь боту и попробуйте ещё раз.

source: Not scheduled
ru: Не запланирован

source: Notice
ru: Сообщение

source: Number of attempts to request an IP address.
ru: Количество попыток запроса IP адреса

source: Off
ru: Выключить

source: Off-state delay
ru: Задержка выключенного состояния

source: Off-state delay for blinking option.
ru: Задержка выключенного состояния для опции мигания.

source: On
ru: Включить

source: On startup
ru: При запуске

source: On-state delay
ru: Задержка включённого состояния

source: On-state delay for blinking option.
ru: Задержка включённого состояния для опции мигания.

source: One of the following:
ru: Одно из следующих значений:

source: Password
ru: Пароль

source: Password for SMTP authentication.
ru: Пароль для SMTP-аутентификации.

source: Period of time after connecting to Internet before up-script runs.
ru: Период времени после подключения к Интернет перед запуском up-script.

source: Period of time after connecting to the Internet before sending a message.
ru: Период времени после подключения к Интернет перед отправкой сообщения.

source: Period of time after disconnecting from Internet before down-script runs.
ru: Период времени после отключения от Интернет перед запуском down-script.

source: Period of time after disconnecting from Internet before sending a message.
ru: Период времени отсутствия доступа в Интренет перед отправкой сообщения.

source: Period of time without Internet access before modem restart.
ru: Период времени отсутствия доступа в Интренет перед перезапуском модема.

source: Period of time without Internet access before network restart.
ru: Период времени отсутствия доступа в Интренет перед перезапуском сети.

source: Period of time without Internet access until the device is rebooted.
ru: Период времени отсутствия доступа в Интренет перед перезагрузкой устройства.

source: Regular script
ru: Регулярный скрипт

source: Polling interval
ru: Интервал опроса

source: Provider
ru: Провайдер

source: Public IP
ru: Публичный IP

source: Public IP address
ru: Публичный IP адрес

source: Reboot device
ru: Перезагрузка устройства

source: Reboot device if the Internet is disconnected at service startup.
ru: Перезагрузка устройства если Интренет отключен при запуске службы.

source: Receive
ru: Приём

source: Recipient
ru: Получатель

source: Request chat ID from bot API
ru: Запросить ID чата через API бота

source: Restart
ru: Перезапуск

source: Restart attempts
ru: Попытки перезапуска

source: Restart modem
ru: Перезапуск модема

source: Restart modem if the Internet is disconnected at service startup.
ru: Перезапуск модема если Интренет отключен при запуске службы.

source: Restart network
ru: Перезапуск сети

source: Restart network if the Internet is disconnected at service startup.
ru: Перезапуск сети если Интренет отключен при запуске службы.

source: Restart service
ru: Перезапуск службы

source: Device timeout
ru: Таймаут устройства

source: Run interval
ru: Интервал запуска

source: Run if Internet state is
ru: Выполнять если статус Интернет

source: Run service at startup
ru: Запуск службы при старте

source: Run down-script if the Internet is disconnected at service startup.
ru: Выполнить down-script если Интренет отключен при запуске службы.

source: Run up-script if the Internet is connected at service startup.
ru: Выполнить up-script если Интренет подключен при запуске службы.

source: Running
ru: Выполняется

source: SMTP server
ru: SMTP-сервер

source: SMTP server port
ru: Порт SMTP-сервера

source: SSL: SMTP over SSL.
ru: SSL: SMTP поверх SSL.

source: Save
ru: Сохранить

source: Security
ru: Безопасность

source: Send message on service startup.
ru: Отправлять сообщение при запуске службы.

source: Sender
ru: Отправитель

source: Server response timeout
ru: Таймаут ответа сервера

source: Service
ru: Служба

source: Service action failed "%s %s": %s
ru: Не удалось выполнить действие службы "%s %s": %s

source: Service configuration
ru: Конфигурация службы

source: Service for determining the public IP address.
ru: Сервис для определения публичного IP адреса.

source: Service: detector always runs as a system service.
ru: Служба: детектор работает постоянно, как системная служба.

source: Set the modem to be allowed to use any band.
ru: Разрешить модему использование любой частоты.

source: Shell commands that are run regularly.
ru: Команды shell выполняемые регулярно.

source: Shell commands that run when connected to the Internet.
ru: Команды shell выполняемые при подключении к Интернет.

source: Shell commands that run regularly at a specified interval. Current state of the Internet is available as value of the <code>$INET_STATE</code> variable (<code>0</code> - connected, <code>1</code> - disconnected).
ru: Команды shell выполняемые регулярно с заданным интервалом. Текущее состояние Интернет доступно как значение переменной <code>$INET_STATE</code> (<code>0</code> - подключен, <code>1</code> - отключен).

source: Shell commands that run when the public IP address changes. New IP is available as value of the <code>$PUBLIC_IP</code> variable (empty string if undefined).
ru: Команды shell выполняемые при изменении публичного IP адреса. Новый IP доступен как значение переменной <code>$PUBLIC_IP</code> (пустая строка если не определён).

source: Shell commands to run when connected or disconnected from the Internet.
ru: Команды shell выполняемые при подключении или отключении Интернет.

source: Shell commands to run when disconnected from the Internet.
ru: Команды shell выполняемые при отключении от Интернет.

source: Small: 1 byte
ru: Маленький: 1 байт

source: Standard: 56 bytes
ru: Стандартный: 56 байт

source: Stopped
ru: Остановлена

source: TCP port
ru: TCP-порт

source: TCP port connection
ru: Подключение к TCP-порту

source: Telegram bot API token.
ru: API токен Telegram бота.

source: Telegram message will be sent when connected or disconnected from the Internet.
ru: Сообщение в Telegram будет отправлено при подключении или отключении от Интернет.

source: The type of record requested in the DNS query (if the service supports it).
ru: Тип записи запрашиваемой в DNS-запросе (если сервис поддерживает).

source: TLS: use STARTTLS if the server supports it.
ru: TLS: использовать STARTTLS если сервер поддерживает.

source: Timeout between stopping and starting a network device when restarting.
ru: Таймаут между остановкой и запуском сетевого устройства при перезапуске.

source: Timeout between stopping and starting a ModemManger interface when restarting.
ru: Таймаут между остановкой и запуском интерфейса ModemManger при перезапуске.

source: To support HTTP services you need to install curl.
ru: Для поддержки HTTP сервисов необходимо установить curl.

source: Tramsmit
ru: Передача

source: Type a time string
ru: Введите строку времени

source: Unable to read the contents
ru: Невозможно прочитать содержимое

source: Unable to save the contents
ru: Невозможно сохранить содержимое

source: Undefined
ru: Неопределён

source: Unlock modem bands
ru: Освободить частоты модема

source: User
ru: Пользователь

source: User scripts
ru: Пользовательские скрипты

source: Username for SMTP authentication.
ru: Имя пользователя для SMTP-аутентификации.

source: Waiting for a reboot to complete before performing a forced reboot.
ru: Ожидание завершения перезагрузки перед выполнением принудительной перезагрузки.

source: Warning
ru: Внимание

source: Web UI only (UI detector)
ru: Только web-интерфейс (UI детектор)

source: Web UI only: detector works only when the Web UI is open (UI detector).
ru: Только web-интерфейс: детектор работает только в web-интерфейсе (UI детектор).

source: When email will be sent
ru: Когда будет отправлено сообщение

source: When message will be sent
ru: Когда будет отправлено сообщение

source: Windows: 32 bytes
ru: Windows: 32 байта

source: You need to register a new %sTelegram bot%s. Then get the bot's API token and paste it into the <code>Bot token</code> field. After that, open a chat with the bot, write something (in the Telegram app) and you will be able to get the chat ID using the <code>ID</code> button.
ru: Необходимо зарегистрировать новый %sTelegram бот%s. Затем получить API токен бота и вставить его в поле <code>Токен бота</code>. После этого, откройте чат с ботом, напишите что-нибудь (в приложении Telegram) и можно будет получить ID чата с помощью кнопки <code>ID</code>.

source: after connection
ru: после подключения

source: after connection or disconnection
ru: после подключения или отключения

source: after disconnection
ru: после отключения

source: connected
ru: подключен

source: connected or disconnected
ru: подключен или отключен

source: days
ru: дни

source: disconnected
ru: отключен

source: hour
ru: час

source: infinitely
ru: бесконечно

source: hours
ru: часы

source: min
ru: мин

source: minutes
ru: минуты

source: msec
ru: мсек

source: sec
ru: сек

source: seconds
ru: секунды
