Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall.po
Languages: ru

source: Enable auto update rules
ru: Автообновление правил

source: Update Time(every day)
ru: Время обновления (ежедневно)

source: Update Interval(hour)
ru: Интервал обновления (часы)

source: Update Mode
ru: Режим обновления

source: Loop Mode
ru: Циклический

source: Every day
ru: Ежедневно

source: Every Monday
ru: По понедельникам

source: Every Tuesday
ru: По вторникам

source: Every Wednesday
ru: По средам

source: Every Thursday
ru: По четвергам

source: Every Friday
ru: По пятницам

source: Every Saturday
ru: По субботам

source: Every Sunday
ru: По воскресеньям

source: hour
ru: час

source: Hour
ru: Час

source: GeoIP Update URL
ru: URL обновления GeoIP

source: Geosite Update URL
ru: URL обновления Geosite

source: Location of Geo rule files
ru: Папка для Geo-файлов

source: This variable specifies a directory where geoip.dat and geosite.dat files are.
ru: Укажите директорию, в которой находятся файлы geoip.dat и geosite.dat.

source: Enable GeoIP Data Parsing
ru: Включить анализ данных GeoIP

source: Analyzes and preloads GeoIP data to enhance the shunt performance.
ru: Анализирует и предварительно загружает данные GeoIP для улучшения работы разделения трафика.

source: Note: Increases resource usage.
ru: Примечание: увеличивает нагрузку на систему.

source: Shunt Rule
ru: Правила разделения трафика

source: Please note attention to the priority, the higher the order, the higher the priority.
ru: Обратите внимание: правила выше в списке имеют более высокий приоритет.

source: Update...
ru: Обновление...

source: It is the latest version
ru: Установлена последняя версия

source: Update successful
ru: Обновление успешно

source: Click to update
ru: Нажмите для обновления

source: Updating...
ru: Идёт обновление...

source: Retry
ru: Повторить

source: Unexpected error
ru: Непредвиденная ошибка

source: Updating, are you sure to close?
ru: Идёт обновление. Вы уверены, что хотите закрыть?

source: Downloading...
ru: Загрузка...

source: Unpacking...
ru: Распаковка...

source: Moving...
ru: Перемещение...

source: App Update
ru: Обновление компонентов

source: Please confirm that your firmware supports FPU.
ru: Убедитесь, что ваша прошивка поддерживает FPU.

source: if you want to run from memory, change the path, /tmp beginning then save the application and update it manually.
ru: Если вы хотите запускать из оперативной памяти, измените путь на начинающийся с /tmp, затем сохраните настройки и обновите компонент вручную.

source: Make sure there is enough space to install %s
ru: Убедитесь, что достаточно места для установки %s

source: App Path
ru: Путь к приложению

source: %s App Path
ru: Путь к приложению %s

source: %s Client App Path
ru: Путь к клиенту %s

source: Node Subscribe
ru: Подписки

source: Subscribe Remark
ru: Название подписки

source: Subscribe Info
ru: Информация о подписке

source: Subscribe URL
ru: URL подписки

source: Subscribe URL Access Method
ru: Способ доступа к URL подписки

source: When adding a new subscription, please save and apply before manually subscribing. If you only change the subscription URL, you can subscribe manually, and the system will save it automatically.
ru: При добавлении новой подписки сначала сохраните и примените настройки, затем выполните ручную подписку. Если вы только изменили URL — можно сразу выполнить ручную подписку, система сохранит изменения автоматически.

source: Please save and apply before manually subscribing.
ru: Сохраните и примените настройки перед ручной подпиской.

source: Subscribe URL cannot be empty.
ru: URL подписки не может быть пустым.

source: Subscribe via proxy
ru: Подписка через прокси

source: Enable auto update subscribe
ru: Автообновление подписки

source: Manual subscription
ru: Ручное обновление подписки

source: Delete All Subscribe Node
ru: Удалить все узлы из подписки

source: Delete the subscribed node
ru: Удалить узел

source: Are you sure you want to delete all subscribed nodes?
ru: Вы действительно хотите удалить все узлы, добавленные через подписку?

source: Manual subscription All
ru: Ручное обновление всех подписок

source: This remark already exists, please change a new remark.
ru: Такое название уже существует, выберите другое.

source: Remark cannot be empty.
ru: Название не может быть пустым.

source: URL cannot be empty.
ru: URL не может быть пустым.

source: Filter keyword Mode
ru: Режим фильтрации по ключевым словам

source: Discard List
ru: Отбрасывать совпадения

source: Keep List
ru: Оставлять только совпадения

source: Discard List,But Keep List First
ru: Отбрасывать совпадения, но сначала применить список исключений

source: Keep List,But Discard List First
ru: Оставлять только совпадения, но сначала применить список отбрасывания

source: Use global config
ru: Использовать глобальные настройки

source: Add
ru: Добавить

source: ACLs
ru: Правила доступа

source: ACLs is a tools which used to designate specific IP proxy mode.
ru: Правила доступа (ACL) позволяют задавать особый режим прокси для отдельных IP-адресов.

source: Example:
ru: Пример:

source: IP range
ru: Диапазон IP

source: Source Interface
ru: Исходящий интерфейс

source: Use Interface With ACLs
ru: Применять правила к интерфейсу

source: Remarks
ru: Описание

source: Direct List
ru: Список прямого доступа

source: Proxy List
ru: Список для прокси

source: Block List
ru: Список блокировки

source: Lan IP List
ru: Список LAN-IP

source: Route Hosts
ru: Файл hosts

source: Join the direct hosts list of domain names will not proxy.
ru: Домены из этого списка будут обходить прокси. Правило действует для всех режимов и имеет наивысший приоритет.

source: These had been joined ip addresses will not proxy. Please input the ip address or ip address segment,every line can input only one ip address. For example: 192.168.0.0/24 or 223.5.5.5.
ru: IP-адреса и подсети из этого списка будут обходить прокси. Вводите по одному значению на строку. Пример: 192.168.0.0/24 или 223.5.5.5.

source: These had been joined websites will use proxy. Please input the domain names of websites, every line can input only one website domain. For example: google.com.
ru: Домены из этого списка будут использовать прокси. Вводите по одному домену на строку. Пример: google.com.

source: These had been joined ip addresses will use proxy. Please input the ip address or ip address segment, every line can input only one ip address. For example: 35.24.0.0/24 or 8.8.4.4.
ru: IP-адреса и подсети из этого списка будут использовать прокси. Вводите по одному значению на строку. Пример: 35.24.0.0/24 или 8.8.4.4.

source: These had been joined websites will be block. Please input the domain names of websites, every line can input only one website domain. For example: twitter.com.
ru: Домены из этого списка будут блокироваться. Вводите по одному домену на строку. Пример: twitter.com.

source: The list is the IPv4 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
ru: Список IPv4-адресов локальной сети, которые всегда подключаются напрямую. Если вам нужно, чтобы LAN-IP использовал прокси, удалите его из этого списка. По умолчанию не изменяйте этот список.

source: The list is the IPv6 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
ru: Список IPv6-адресов локальной сети, которые всегда подключаются напрямую. Если вам нужно, чтобы LAN-IP использовал прокси, удалите его из этого списка. По умолчанию не изменяйте этот список.

source: Configure routing etc/hosts file, if you don't know what you are doing, please don't change the content.
ru: Редактирование файла hosts роутера. Если вы не уверены в своих действиях, не изменяйте содержимое.

source: These had been joined ip addresses will be block. Please input the ip address or ip address segment, every line can input only one ip address.
ru: IP-адреса и подсети из этого списка будут блокироваться. Вводите по одному значению на строку.

source: Inbound Tag
ru: Метка входящего соединения

source: Transparent proxy
ru: Прозрачный прокси

source: Not valid domain name, please re-enter!
ru: Неверный формат домена, пожалуйста, введите заново!

source: Not valid IP format, please re-enter!
ru: Неверный формат IP, пожалуйста, введите заново!

source: Not valid IPv4 format, please re-enter!
ru: Неверный формат IPv4, пожалуйста, введите заново!

source: Not valid IPv6 format, please re-enter!
ru: Неверный формат IPv6, пожалуйста, введите заново!

source: Not true format, please re-enter!
ru: Неверный формат, пожалуйста, введите заново!

source: Plaintext: If this string matches any part of the targeting domain, this rule takes effet. Example: rule 'sina.com' matches targeting domain 'sina.com', 'sina.com.cn' and 'www.sina.com', but not 'sina.cn'.
ru: Текст: правило срабатывает, если строка встречается в любом месте домена. Например, 'sina.com' совпадёт с 'sina.com', 'sina.com.cn', 'www.sina.com', но не с 'sina.cn'.

source: Regular expression: Begining with 'regexp:', the rest is a regular expression. When the regexp matches targeting domain, this rule takes effect. Example: rule 'regexp:\.goo.*\.com$' matches 'www.google.com' and 'fonts.googleapis.com', but not 'google.com'.
ru: Регулярное выражение: начинается с 'regexp:', далее — шаблон. Правило срабатывает при совпадении. Например, 'regexp:\.goo.*\.com$' совпадёт с 'www.google.com' и 'fonts.googleapis.com', но не с 'google.com'.

source: Subdomain (recommended): Begining with 'domain:' and the rest is a domain. When the targeting domain is exactly the value, or is a subdomain of the value, this rule takes effect. Example: rule 'domain:v2ray.com' matches 'www.v2ray.com', 'v2ray.com', but not 'xv2ray.com'.
ru: Поддомен (рекомендуется): начинается с 'domain:', далее — домен. Правило срабатывает для точного совпадения или любого поддомена. Например, 'domain:v2ray.com' совпадёт с 'www.v2ray.com' и 'v2ray.com', но не с 'xv2ray.com'.

source: Full domain: Begining with 'full:' and the rest is a domain. When the targeting domain is exactly the value, the rule takes effect. Example: rule 'domain:v2ray.com' matches 'v2ray.com', but not 'www.v2ray.com'.
ru: Полное совпадение: начинается с 'full:', далее — домен. Правило срабатывает только при точном совпадении. Например, 'full:v2ray.com' совпадёт только с 'v2ray.com', но не с 'www.v2ray.com'.

source: Sing-Box rule-set: Begining with 'rule-set:remote:' or 'rule-set:local:'
ru: Набор правил Sing-Box: начинается с 'rule-set:remote:' или 'rule-set:local:'

source: Such as:
ru: Например:

source: Pre-defined domain list: Begining with 'geosite:' and the rest is a name, such as geosite:google or geosite:cn.
ru: Предопределённый список: начинается с 'geosite:', далее — имя набора, например geosite:google или geosite:cn.

source: Annotation: Begining with #
ru: Комментарий начинается с #

source: Invert match result.
ru: Инвертировать результат.

source: Only support Sing-Box.
ru: Поддерживается только в Sing-Box.

source: IP: such as '127.0.0.1'.
ru: IP: например, '127.0.0.1'.

source: CIDR: such as '127.0.0.0/8'.
ru: CIDR: например, '10.0.0.0/8'.

source: GeoIP: such as 'geoip:cn'. It begins with geoip: (lower case) and followed by two letter of country code.
ru: GeoIP: например, 'geoip:cn'. Должно начинаться с 'geoip:' (строчными), далее — двухбуквенный код страны.

source: Clear logs
ru: Очистить журнал

source: Password
ru: Пароль

source: IV Check
ru: Проверка IV

source: UDP over TCP
ru: UDP через TCP

source: Connection Timeout
ru: Тайм-аут подключения

source: Local Port
ru: Локальный порт

source: Pre-connections
ru: Предварительные соединения

source: Number of early established connections to reduce latency.
ru: Количество заранее установленных соединений для снижения задержки.

source: plugin
ru: Плагин

source: Supports custom SIP003 plugins, Make sure the plugin is installed.
ru: Поддерживаются пользовательские плагины SIP003. Убедитесь, что плагин установлен.

source: opts
ru: опции

source: Protocol
ru: Протокол

source: Protocol_param
ru: Параметры протокола

source: Obfs
ru: Обфускация

source: Obfs_param
ru: Параметры обфускации

source: Plugin Name
ru: Название плагина

source: Plugin Arguments
ru: Аргументы плагина

source: User Level
ru: Уровень доступа

source: Transport
ru: Транспорт

source: Public Key
ru: Публичный ключ

source: Private Key
ru: Приватный ключ

source: Pre shared key
ru: Дополнительный симметричный ключ

source: Local Address
ru: Локальный адрес

source: System interface
ru: Системный интерфейс

source: System interface name
ru: Имя системного интерфейса

source: Decimal numbers separated by "," or Base64-encoded strings.
ru: Десятичные числа через запятую или строки в кодировке Base64.

source: Camouflage Domain
ru: Маскировочный домен

source: Camouflage Type
ru: Тип маскировки

source: Transport Layer Encryption
ru: Шифрование транспортного уровня

source: Whether or not transport layer encryption is enabled, "none" for unencrypted, "tls" for using TLS, "xtls" for using XTLS.
ru: Включено ли шифрование транспортного уровня: «none» — без шифрования, «tls» — TLS, «xtls» — XTLS.

source: Original Trojan only supported 'tls', please choose 'tls'.
ru: Оригинальный Trojan поддерживает только 'tls' — выберите этот вариант.

source: Transfer mode
ru: Режим передачи

source: Do not send server name in ClientHello.
ru: Не отправлять имя сервера в ClientHello.

source: Domain
ru: Домен

source: allowInsecure
ru: Пропускать проверку сертификата

source: Whether unsafe connections are allowed. When checked, Certificate validation will be skipped.
ru: Разрешить соединения без проверки сертификата. При включении валидация будет пропущена.

source: %s Node Use Type
ru: Тип использования сервера %s

source: Set the TUIC proxy server ip address
ru: Указать IP-адрес сервера TUIC

source: TUIC User Password For Connect Remote Server
ru: Пароль для подключения к удалённому серверу TUIC

source: TUIC UserName For Local Socks
ru: Имя пользователя для локального SOCKS TUIC

source: TUIC Password For Local Socks
ru: Пароль для локального SOCKS TUIC

source: UDP relay mode
ru: Режим ретрансляции UDP

source: Congestion control algorithm
ru: Алгоритм контроля перегрузок

source: Heartbeat interval(second)
ru: Интервал heartbeat-пакетов (сек)

source: Timeout for establishing a connection to server(second)
ru: Тайм-аут установки соединения с сервером (сек)

source: Garbage collection interval(second)
ru: Интервал очистки фрагментов UDP (сек)

source: Garbage collection lifetime(second)
ru: Время жизни фрагментов UDP на сервере (сек)

source: Disable SNI
ru: Отключить SNI

source: Enable 0-RTT QUIC handshake
ru: Включить 0-RTT рукопожатие QUIC

source: TUIC send window
ru: Окно отправки TUIC (макс. байт без подтверждения: по умолчанию 8 МБ × 2)

source: TUIC receive window
ru: Окно приёма TUIC (макс. байт без подтверждения: по умолчанию 8 МБ)

source: TUIC Maximum packet size the socks5 server can receive from external, in bytes
ru: Макс. размер пакета, который SOCKS5-сервер TUIC может принять извне (в байтах)

source: Set if the listening socket should be dual-stack
ru: Включить поддержку dual-stack для слушающего сокета

source: <br />none: default, no masquerade, data sent is packets with no characteristics.<br />srtp: disguised as an SRTP packet, it will be recognized as video call data (such as FaceTime).<br />utp: packets disguised as uTP will be recognized as bittorrent downloaded data.<br />wechat-video: packets disguised as WeChat video calls.<br />dtls: disguised as DTLS 1.2 packet.<br />wireguard: disguised as a WireGuard packet. (not really WireGuard protocol)<br />dns: Disguising traffic as DNS requests.
ru: <br />none: по умолчанию, без маскировки, данные отправляются обычными пакетами.<br />srtp: маскировка под SRTP — трафик определяется как видеозвонок (например, FaceTime).<br />utp: маскировка под uTP — трафик определяется как BitTorrent.<br />wechat-video: маскировка под видеозвонок WeChat.<br />dtls: маскировка под DTLS 1.2.<br />wireguard: маскировка под WireGuard (не настоящий протокол WireGuard).<br />dns: маскировка трафика под DNS-запросы.

source: Use it together with the DNS disguised type. You can fill in any domain.
ru: Используется вместе с типом маскировки DNS. Можно указать любой домен.

source: Auth
ru: Аутентификация

source: Socks for authentication
ru: Аутентификация SOCKS

source: Socks protocol authentication, support anonymous and password.
ru: Метод аутентификации SOCKS: анонимный или по логину/паролю.

source: anonymous
ru: анонимно

source: User Password
ru: Логин и пароль

source: Username and Password must be used together!
ru: Логин и пароль должны быть указаны вместе!

source: Prefer firewall tools
ru: Предпочтительный инструмент фаервола

source: Experimental feature. Make sure that your node supports IPv6.
ru: Экспериментальная функция. Убедитесь, что ваш сервер поддерживает IPv6.

source: Status info
ru: Информация о статусе

source: Big icon
ru: Крупный значок

source: Show node check
ru: Показывать проверку серверов

source: Show Show IP111
ru: Показывать IP111

source: Destination protocol
ru: Целевой протокол

source: Destination address
ru: Целевой адрес

source: Destination port
ru: Целевой порт

source: Whether to receive PROXY protocol, when this node want to be fallback or forwarded by proxy, it must be enable, otherwise it cannot be used.
ru: Принимать ли PROXY protocol. Если этот сервер используется для fallback или перенаправления через прокси, опция должна быть включена, иначе работа невозможна.

source: outbound node
ru: Исходящий сервер

source: Custom Socks
ru: Пользовательский SOCKS

source: Custom HTTP
ru: Пользовательский HTTP

source: Custom Interface
ru: Пользовательский интерфейс

source: Interface
ru: Интерфейс

source: Bind Local
ru: Только для localhost

source: When selected, it can only be accessed localhost.
ru: Если включено, доступ возможен только с самого роутера.

source: Accept LAN Access
ru: Разрешить доступ из LAN

source: When selected, it can accessed lan , this will not be safe!
ru: Если включено, сервис будет доступен из локальной сети. Это небезопасно! (Не рекомендуется без необходимости).

source: Enable Remote
ru: Включить перенаправление

source: You can forward to Nginx/Caddy/V2ray/Xray WebSocket and more.
ru: Можно перенаправлять на Nginx/Caddy/V2Ray/Xray WebSocket и другие сервисы.

source: Remote Address
ru: Удалённый адрес

source: Remote Port
ru: Удалённый порт

source: as:
ru: например:

source: Public key absolute path
ru: Полный путь к публичному ключу

source: Private key absolute path
ru: Полный путь к приватному ключу

source: Can't find this file!
ru: Файл не найден!

source: Public key and Private key path can not be empty!
ru: Пути к публичному и приватному ключам не могут быть пустыми!

source: Server-Side
ru: Серверная часть

source: Server Config
ru: Конфигурация сервера

source: Users Manager
ru: Управление пользователями

source: Logs
ru: Журнал

source: Log
ru: Журнал

source: Enable Node Log
ru: Запись журнала

source: Log Level
ru: Уровень записи журнала

source: Not enabled log
ru: Запись журнала отключена

source: UDP Forward
ru: UDP-перенаправление

source: DNS Settings
ru: Настройки DNS

source: Null
ru: Нет

source: You did not fill in the %s path. Please save and apply then update manually.
ru: Вы не указали путь к %s. Сохраните настройки, затем выполните обновление вручную.

source: Not installed %s, Can't unzip!
ru: %s не установлен — распаковка невозможна.

source: Can't determine ARCH, or ARCH not supported.
ru: Не удалось определить архитектуру, или она не поддерживается.

source: Get remote version info failed.
ru: Не удалось получить информацию о версии с сервера.

source: New version found, but failed to get new version download url.
ru: Обнаружена новая версия, но не удалось получить ссылку для загрузки.

source: Download url is required.
ru: Необходимо указать URL для загрузки.

source: File download failed or timed out: %s
ru: Ошибка загрузки файла или тайм-аут: %s

source: File path required.
ru: Необходимо указать путь к файлу.

source: %s not enough space.
ru: Недостаточно места для %s.

source: Can't find client in file: %s
ru: Не удалось найти клиент в файле: %s

source: Client file is required.
ru: Необходимо указать файл клиента.

source: The client file is not suitable for current device.
ru: Файл клиента не подходит для текущего устройства.

source: Can't move new file to path: %s
ru: Не удалось переместить файл в: %s

source: An XHttpObject in JSON format, used for sharing.
ru: XHttpObject в формате JSON, используется для обмена настройками.

source: Enable Mux.Cool
ru: Включить Mux.Cool

source: Mux concurrency
ru: Макс. параллельных соединений

source: XUDP Mux concurrency
ru: Макс. параллельных соединений XUDP

source: Padding
ru: Заполнение

source: Enable early data
ru: Включить 0-RTT данные

source: Early data length
ru: Макс. длина 0-RTT данных

source: Early data header name
ru: Имя HTTP-заголовка для 0-RTT

source: Recommended value: Sec-WebSocket-Protocol
ru: Рекомендуемое значение: Sec-WebSocket-Protocol

source: Health check
ru: Проверка доступности

source: Health check timeout
ru: Тайм-аут проверки

source: Permit without stream
ru: Проверка без активного потока

source: Initial Windows Size
ru: Начальный размер окна

source: Excluded Domains
ru: Исключённые домены

source: If the traffic sniffing result is in this list, the destination address will not be overridden.
ru: Если результат анализа трафика есть в этом списке, целевой адрес не будет заменён.

source: Buffer Size
ru: Размер буфера

source: Buffer size for every connection (kB)
ru: Размер буфера для каждого соединения (КБ)

source: Handshake Timeout
ru: Тайм-аут рукопожатия

source: Idle Timeout
ru: Тайм-аут простоя

source: Hop Interval
ru: Интервал смены порта

source: HeartbeatPeriod(second)
ru: Период heartbeat-пакетов (сек)

source: Override the connection destination address
ru: Заменять целевой адрес соединения

source: Override the connection destination address with the sniffed domain.<br />Otherwise use sniffed domain for routing only.<br />If using shunt nodes, configure the domain shunt rules correctly.
ru: Заменять целевой адрес на домен, полученный при анализе трафика.<br />Иначе домен будет использоваться только для маршрутизации.<br />При использовании серверов разделения трафика правильно настройте правила доменной маршрутизации.

source: Override the connection destination address with the sniffed domain.<br />When enabled, traffic will match only by domain, ignoring IP rules.<br />If using shunt nodes, configure the domain shunt rules correctly.
ru: Заменять целевой адрес на домен, полученный при анализе трафика.<br />При включении трафик будет сопоставляться только по домену, IP-правила игнорируются.<br />При использовании серверов разделения трафика правильно настройте правила доменной маршрутизации.

source: Handshake Server
ru: Сервер рукопожатия

source: Handshake Server Port
ru: Порт сервера рукопожатия

source: Protocol parameter. Will waste traffic randomly if enabled.
ru: Параметр протокола. При включении случайным образом увеличивает расход трафика.

source: Protocol parameter. Enable length block encryption.
ru: Параметр протокола. Включает шифрование блоков длины.

source: TLS Chain Fingerprint (SHA256)
ru: Отпечаток цепочки TLS (SHA256)

source: Once set, connects only when the server's chain fingerprint matches.
ru: После установки соединение возможно только при совпадении отпечатка цепочки сервера.

source: TLS Certificate Name (CertName)
ru: Имя TLS-сертификата (CertName)
