Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall.po
Languages: ru

source: Auto
ru: Авто

source: RUNNING
ru: Служба активна

source: NOT RUNNING
ru: Служба остановлена

source: Working...
ru: Выполняется...

source: Problem detected!
ru: Обнаружена ошибка!

source: Touch Check
ru: Проверить доступность

source: Global
ru: Глобальный режим

source: Kernel Unsupported
ru: Ядро несовместимо

source: Basic Settings
ru: Общие параметры

source: Node List
ru: Список узлов

source: Other Settings
ru: Дополнительные настройки

source: Load Balancing
ru: Балансировка трафика

source: Enter interface
ru: Открыть интерфейс

source: Rule Manage
ru: Управление правилами

source: Rule List
ru: Список правил

source: Access control
ru: Контроль доступа

source: Watch Logs
ru: Просмотр журнала

source: Node Config
ru: Параметры узла

source: Running Status
ru: Состояние системы

source: Baidu Connection
ru: Baidu

source: Google Connection
ru: Google

source: GitHub Connection
ru: GitHub

source: Instagram Connection
ru: Instagram

source: Node Check
ru: Проверка узлов

source: Check...
ru: Идёт проверка...

source: Clear
ru: Очистить

source: Main switch
ru: Включить модуль

source: Node
ru: Узел

source: Edit Current Node
ru: Изменить выбранный узел

source: Localhost Proxy
ru: Прокси для самого роутера

source: When selected, localhost can transparent proxy.
ru: Если включено, трафик самого роутера будет идти через прозрачный прокси.

source: Client Proxy
ru: Прокси для клиентских устройств

source: When selected, devices in LAN can transparent proxy. Otherwise, it will not be proxy. But you can still use access control to allow the designated device to proxy.
ru: Если включено, все устройства в локальной сети будут автоматически использовать прозрачный прокси. В противном случае прокси не активируется, но вы можете добавить исключения через список контроля доступа.

source: Missing components, transparent proxy is unavailable.
ru: Не установлены необходимые компоненты — прозрачный прокси недоступен.

source: Socks Config
ru: Настройки SOCKS-прокси

source: Socks Node
ru: SOCKS-сервер

source: Current Node
ru: Активный сервер

source: Listen Port
ru: Порт прослушивания

source: 0 is not use
ru: 0 — отключить функцию

source: Current node: %s
ru: Текущий узел: %s

source: IP:Port mode acceptable, multi value split with english comma.
ru: Допустим формат IP:Port. Несколько значений указывайте через запятую.

source: Direct DNS Protocol
ru: Протокол прямого DNS

source: Direct DNS
ru: Прямой DNS

source: Direct DNS DoH
ru: Прямой DNS-over-HTTPS

source: Direct DNS EDNS Client Subnet
ru: EDNS Client Subnet для прямого DNS

source: Remote DNS Protocol
ru: Протокол прокси-DNS

source: Remote DNS
ru: Прокси-DNS

source: Remote DNS DoH
ru: Прокси DNS-over-HTTPS

source: Remote DNS EDNS Client Subnet
ru: EDNS Client Subnet для прокси-DNS

source: Notify the DNS server when the DNS query is notified, the location of the client (cannot be a private IP address).
ru: Сообщает DNS-серверу примерное местоположение клиента при запросе. Указывайте публичный IP-адрес.

source: This feature requires the DNS server to support the Edns Client Subnet (RFC7871).
ru: Функция работает только если DNS-сервер поддерживает EDNS Client Subnet (RFC7871).

source: Remote DNS Outbound
ru: Маршрут для прокси-DNS

source: Remote
ru: Через прокси

source: Direct
ru: Прямой

source: Direct Query Strategy
ru: Стратегия прямого запроса

source: Remote Query Strategy
ru: Стратегия прокси-запроса

source: Use FakeDNS work in the domain that proxy.
ru: Использовать FakeDNS для доменов, проходящих через прокси

source: Suitable scenarios for let the node servers get the target domain names.
ru: Позволяет узлам получать реальные доменные имена (вместо подставных адресов).

source: Such as: DNS unlocking of streaming media, reducing DNS query latency, etc.
ru: Например: разблокировка стриминговых сервисов, ускорение разрешения имён и т.п.

source: Domain Override
ru: Переопределение доменов

source: Direct DNS result write to IPSet
ru: Записывать результаты прямого DNS в IPSet

source: Perform the matching direct domain name rules into IP to IPSet/NFTSet, and then connect directly (not entering the core).
ru: IP-адреса доменов, подходящих под правила прямого доступа, добавляются в IPSet/NFTSet для обхода ядра прокси.

source: Maybe conflict with some special circumstances.
ru: В отдельных случаях может конфликтовать с другими правилами.

source: DNS Redirect
ru: Перехват DNS-запросов

source: Force special DNS server to need proxy devices.
ru: Принудительно направлять DNS-запросы устройств через прокси на выделенный сервер.

source: Clear IPSET
ru: Очистить IPSet

source: Clear NFTSET
ru: Очистить NFTSet

source: Try this feature if the rule modification does not take effect.
ru: Используйте, если изменения в правилах не применяются.

source: About DNS issues:
ru: Важно о настройке DNS:

source: Some browsers may have built-in DNS, be sure to close. Example: Chrome. Settings - Security and Privacy - Security - Use secure DNS disabled.
ru: Некоторые браузеры используют собственный DNS. Отключите эту функцию: в Chrome это «Настройки → Конфиденциальность и безопасность → Безопасность → Использовать безопасный DNS».

source: Sometimes after restart, you can not internet. At this time, close all browsers (important), Windows Client, please `ipconfig /flushdns`. Please close the WiFi on the phone, cut the flight mode and then cut back.
ru: Если после перезагрузки нет доступа в сеть: закройте все браузеры, в Windows выполните `ipconfig /flushdns`, на телефоне переключите авиарежим или переподключитесь к Wi-Fi.

source: The client DNS and the default gateway must point to this router.
ru: В настройках клиентов DNS-сервер и шлюз по умолчанию должны указывать на этот роутер.

source: If you have a wrong DNS process, the consequences are at your own risk!
ru: Неверная настройка DNS может привести к потере доступа в сеть — действуйте на свой страх и риск.

source: Hide menu method, input example in the address bar:
ru: Чтобы скрыть меню, введите в адресной строке:

source: After the hidden to the display, input example in the address bar:
ru: Чтобы вернуть меню, введите в адресной строке:

source: Are you sure to hide?
ru: Скрыть меню?

source: DNS related issues:
ru: Возможные проблемы с DNS:

source: Certain browsers such as Chrome have built-in DNS service, which may affect DNS resolution settings. You can go to 'Settings -> Privacy and security -> Use secure DNS' menu to turn it off.
ru: Браузеры вроде Chrome могут использовать собственный DNS, что конфликтует с настройками роутера. Отключите: «Настройки → Конфиденциальность → Безопасность → Использовать безопасный DNS».

source: If you are unable to access the internet after reboot, please try clearing the cache of your terminal devices (make sure to close all open browser application windows first, this step is especially important):
ru: Если после перезагрузки нет доступа в интернет, очистите кэш DNS на устройствах (предварительно закройте все вкладки браузера):

source: For Windows systems, open Command Prompt and run the command 'ipconfig /flushdns'.
ru: Windows: откройте командную строку и выполните `ipconfig /flushdns`.

source: For Mac systems, open Terminal and run the command 'sudo killall -HUP mDNSResponder'.
ru: macOS: откройте Терминал и выполните `sudo killall -HUP mDNSResponder`.

source: For mobile devices, you can clear it by reconnecting to the network, such as toggling Airplane Mode and reconnecting to WiFi.
ru: Мобильные устройства: переключите авиарежим или переподключитесь к Wi-Fi.

source: Please make sure your device's network settings point both the DNS server and default gateway to this router, to ensure DNS queries are properly routed.
ru: Убедитесь, что в настройках сети устройства DNS и шлюз по умолчанию указывают на этот роутер.

source: Browser access:
ru: Доступ через браузер:

source: Hide in main menu:
ru: Скрыть в главном меню:

source: Show in main menu:
ru: Показать в главном меню:

source: DNS Export Of Multi WAN
ru: Выбор WAN-интерфейса для прямого DNS

source: Node Export Of Multi WAN
ru: Выбор WAN-интерфейса для узлов

source: Only support Multi Wan.
ru: Работает только при наличии нескольких WAN-подключений.

source: Not Specify
ru: Не указывать

source: custom
ru: Свой вариант

source: If not available, try clearing the cache.
ru: Если не работает — попробуйте очистить кэш.

source: Operation
ru: Действия

source: Add Node
ru: Добавить узел

source: Add the node via the link
ru: Добавить узел по ссылке

source: Enter share links, one per line. Subscription links are not supported!
ru: Введите ссылки для импорта, по одной на строку. Ссылки на подписки не поддерживаются!

source: Please enter the correct link.
ru: Пожалуйста, введите корректную ссылку.

source: Clear all nodes
ru: Удалить все узлы

source: Are you sure to clear all nodes?
ru: Вы действительно хотите удалить все узлы?

source: Success
ru: Готово

source: Error
ru: Ошибка

source: Delete select nodes
ru: Удалить выбранные узлы

source: To Top
ru: В начало списка

source: Select
ru: Выбрать

source: Selected:
ru: Выбрано:

source: DeSelect
ru: Снять выделение

source: Select all
ru: Выделить все

source: DeSelect all
ru: Снять выделение со всех

source: Are you sure to delete select nodes?
ru: Вы действительно хотите удалить выбранные узлы?

source: You no select nodes !
ru: Вы не выбрали ни одного узла!

source: Are you sure set to
ru: Вы действительно хотите назначить

source: the server?
ru: активным сервером?

source: You choose node is:
ru: Выбранный узел:

source: Timeout
ru: Тайм-аут

source: Node Remarks
ru: Описание узла

source: Add Mode
ru: Способ добавления

source: Save Order
ru: Сохранить порядок

source: Saved current page order successfully.
ru: Порядок элементов сохранён.

source: Drag to reorder
ru: Перетащите для изменения порядка

source: Type
ru: Тип

source: Balancing
ru: Балансировка

source: Node Addition Method
ru: Способ добавления узлов

source: Manual
ru: Вручную

source: Batch
ru: Пакетно

source: Select Group
ru: Выберите группу

source: Node Matching Rules
ru: Правила отбора узлов

source: Example: <code>^A && B && !C && D$</code><br>This means the node remark must start with A (^), include B, exclude C (!), and end with D ($).<br>Conditions are joined by <code>&&</code>, and their order does not affect the result.
ru: Пример: <code>^A && B && !C && D$</code><br>Описание узла должно: начинаться с A (^), содержать B, не содержать C (!), заканчиваться на D ($).<br>Условия соединяются оператором <code>&&</code>, порядок условий не влияет на результат.

source: Balancing Strategy
ru: Алгоритм балансировки

source: Fallback Node
ru: Запасной узел

source: Use Custom Probe URL
ru: Использовать свой URL для проверки

source: By default the built-in probe URL will be used, enable this option to use a custom probe URL.
ru: По умолчанию используется встроенный адрес для проверки. Включите эту опцию, чтобы задать свой URL.

source: Probe URL
ru: URL для диагностики

source: The URL used to detect the connection status.
ru: Адрес, используемый для проверки доступности соединения.

source: Probe Interval
ru: Интервал проверки

source: The interval between initiating probes.
ru: Периодичность проверки доступности.

source: The time format is numbers + units, such as '10s', '2h45m', and the supported time units are <code>s</code>, <code>m</code>, <code>h</code>, which correspond to seconds, minutes, and hours, respectively.
ru: Формат: число + единица измерения, например <code>10s</code>, <code>2h45m</code>. Поддерживаемые единицы: <code>s</code> (секунды), <code>m</code> (минуты), <code>h</code> (часы).

source: When the unit is not filled in, it defaults to seconds.
ru: Если единица не указана, по умолчанию используются секунды.

source: Preferred Node Count
ru: Количество предпочтительных узлов

source: The load balancer selects the optimal number of nodes, and traffic is randomly distributed among them.
ru: Балансировщик выбирает указанное количество наилучших узлов и распределяет трафик между ними случайным образом.

source: Shunt
ru: Shunt (разделение трафика)

source: Preproxy
ru: Цепочка прокси

source: Preproxy Node
ru: Первый узел цепочки

source: Set the node to be used as a pre-proxy.
ru: Укажите узел, который будет использоваться как первый узел в цепочке.

source: Set the node to be used as a pre-proxy. Each rule (including Default) has a separate switch that controls whether this rule uses the pre-proxy or not.
ru: Укажите узел для использования в качестве первого узла цепочки. Каждое правило (включая «По умолчанию») имеет отдельный переключатель, определяющий, использовать ли цепочку для этого правила.

source: Each rule has a separate switch that controls whether this rule uses the pre-proxy or not.
ru: Для каждого правила можно отдельно включить или отключить использование цепочки.

source: Close (Not use)
ru: Отключено

source: Use default node
ru: Использовать узел по умолчанию

source: Direct Connection
ru: Прямое соединение

source: Blackhole (Block)
ru: Блокировка (Blackhole)

source: There are no available nodes, please add or subscribe nodes first.
ru: Нет доступных узлов! Добавьте вручную или настройте подписку.

source: No shunt rules? Click me to go to add.
ru: Нет правил разделения трафика! Нажмите, чтобы добавить.

source: When using, localhost will connect this node first and then use this node to connect the default node.
ru: При использовании трафик сначала пойдёт через этот узел, а затем — через основной узел назначения.

source: Domain Strategy
ru: Порядок разрешения имён

source: Domain matcher
ru: Алгоритм сопоставления доменов

source: 'AsIs': Only use domain for routing. Default value.
ru: AsIs: использовать доменное имя как есть. Значение по умолчанию.

source: 'IPIfNonMatch': When no rule matches current domain, resolves it into IP addresses (A or AAAA records) and try all rules again.
ru: IPIfNonMatch: если домен не подошёл ни под одно правило, разрешить его в IP-адрес и повторить проверку.

source: 'IPOnDemand': As long as there is a IP-based rule, resolves the domain into IP immediately.
ru: IPOnDemand: если встречается правило на основе IP, сразу разрешать домен в адрес.

source: Load balancing node list
ru: Список узлов для балансировки

source: Load balancing node list, <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>document</a>
ru: Список узлов для балансировки, <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>документация</a>

source: From Share URL
ru: Импорт из ссылки

source: Build Share URL
ru: Экспорт в ссылку

source: Generate QRCode
ru: Сгенерировать QR-код

source: Export Config File
ru: Экспорт конфигурации

source: Import Finished
ru: Импорт завершён:

source: Not a supported scheme:
ru: Неподдерживаемый формат:

source: Invalid Share URL Format
ru: Неверный формат ссылки

source: Paste Share URL Here
ru: Вставьте ссылку сюда

source: Share URL to clipboard unable.
ru: Не удалось скопировать ссылку в буфер обмена.

source: Share URL to clipboard successfully.
ru: Ссылка скопирована в буфер обмена.

source: Faltal on get option, please help in debug:
ru: Ошибка при чтении настроек, пожалуйста, сообщите разработчикам:

source: Faltal on set option, please help in debug:
ru: Ошибка при сохранении настроек, пожалуйста, сообщите разработчикам:

source: Address
ru: Адрес

source: Address (Support Domain Name)
ru: Адрес (поддерживаются домены)

source: Trojan Verify Cert
ru: Проверять сертификат (Trojan)

source: Trojan Cert Path
ru: Путь к сертификату (Trojan)

source: Finger Print
ru: TLS отпечаток

source: Avoid using randomized, unless you have to.
ru: Избегайте режима randomized, если в этом нет острой необходимости.

source: Original
ru: Оригинал

source: Transport Plugin
ru: Плагин транспорта

source: Shadowsocks secondary encryption
ru: Дополнительное шифрование Shadowsocks

source: global_padding
ru: Включить padding-заполнение

source: authenticated_length
ru: Шифровать длину пакетов

source: Obfs Type
ru: Тип обфускации

source: Obfs Password
ru: Пароль обфускации

source: Auth Type
ru: Тип аутентификации

source: Auth Password
ru: Пароль аутентификации

source: Commands the client to use the BBR flow control algorithm
ru: Включает использование алгоритма управления потоком BBR на клиенте

source: Certificate fingerprint
ru: Хеш сертификата

source: Max upload Mbps
ru: Макс. скорость отдачи (Мбит/с)

source: Max download Mbps
ru: Макс. скорость загрузки (Мбит/с)

source: QUIC stream receive window
ru: Размер окна приёма потока QUIC

source: QUIC connection receive window
ru: Размер окна приёма соединения QUIC

source: QUIC concurrent bidirectional streams
ru: Макс. количество одновременных двунаправленных потоков QUIC

source: Disable MTU detection
ru: Отключить определение MTU

source: ignoreClientBandwidth
ru: Игнорировать заявленные лимиты пропускной способности клиента

source: Lazy Start
ru: Отложенный старт

source: Encrypt Method
ru: Метод шифрования

source: Encrypt Key
ru: Ключ шифрования

source: Latency
ru: Задержка

source: Automatic detection delay
ru: Метод автопроверки

source: Show server address and port
ru: Показывать адрес и порт узла

source: URL Test Address
ru: Адрес для проверки

source: URL Test
ru: URL-тест

source: Test
ru: Проверить

source: Node num
ru: Количество узлов

source: Self add
ru: Добавлен вручную

source: Apply
ru: Применить

source: Use
ru: Использовать

source: Copy
ru: Копировать

source: Delay Settings
ru: Расписание

source: Open and close Daemon
ru: Запускать демон

source: Delay Start
ru: Отложенный запуск

source: Units:seconds
ru: Единица: секунды

source: Units:minutes
ru: Единица: минуты

source: stop automatically mode
ru: Режим автоотключения

source: stop Time(Every day)
ru: Время отключения (ежедневно)

source: stop Interval(Hour)
ru: Интервал отключения (часы)

source: start automatically mode
ru: Режим автозапуска

source: start Time(Every day)
ru: Время запуска (ежедневно)

source: start Interval(Hour)
ru: Интервал запуска (часы)

source: restart automatically mode
ru: Режим автоперезапуска

source: restart Time(Every day)
ru: Время перезапуска (ежедневно)

source: restart Interval(Hour)
ru: Интервал перезапуска (часы)

source: Forwarding Settings
ru: Настройки перенаправления

source: TCP No Redir Ports
ru: TCP-порты без перенаправления

source: UDP No Redir Ports
ru: UDP-порты без перенаправления

source: Fill in the ports you don't want to be forwarded by the agent, with the highest priority.
ru: Укажите порты, которые не должны обрабатываться прокси. Эти настройки имеют наивысший приоритет.

source: If you don't want to let the device in the list to go proxy, please choose all.
ru: Если вы не хотите, чтобы устройства из списка использовали прокси, выберите «Все».

source: The port settings support single ports and ranges.<br>Separate multiple ports with commas (,).<br>Example: 21,80,443,1000:2000.
ru: Поддерживаются отдельные порты и диапазоны.<br>Несколько значений указывайте через запятую.<br>Пример: 21,80,443,1000:2000.

source: TCP Proxy Drop Ports
ru: TCP-порты для блокировки прокси

source: UDP Proxy Drop Ports
ru: UDP-порты для блокировки прокси

source: TCP Redir Ports
ru: TCP-порты для перенаправления

source: UDP Redir Ports
ru: UDP-порты для перенаправления

source: No patterns are used
ru: Не использовать

source: All
ru: Все

source: Common Use
ru: Распространённые

source: Only Web
ru: Только веб

source: or more
ru: и более

source: or less
ru: и менее

source: Default
ru: По умолчанию

source: Close
ru: Отключить

source: Hijacking ICMP (PING)
ru: Перехват ICMP (PING)

source: Hijacking ICMPv6 (IPv6 PING)
ru: Перехват ICMPv6 (IPv6 PING)

source: Sniffing
ru: Анализ трафика

source: TCP Proxy Way
ru: Метод TCP-проксирования

source: Auto Switch
ru: Автопереключение

source: When there is no server, an automatic reconnect scheme is used
ru: При потере связи автоматически выполняется переподключение

source: How often to test
ru: Частота проверки

source: Timeout seconds
ru: Тайм-аут (сек)

source: Timeout retry num
ru: Количество повторов при тайм-ауте

source: Automatic switching cannot be used when this option is checked
ru: При включении этой опции автопереключение недоступно

source: Main node
ru: Основной узел

source: List of backup nodes
ru: Список резервных узлов

source: Restore Switch
ru: Возврат к основному

source: When detects main node is available, switch back to the main node.
ru: При восстановлении доступности основного узла — автоматически переключиться на него.

source: Add nodes to the standby node list by keywords
ru: Добавить узлы в резервный список по ключевым словам

source: Delete nodes in the standby node list by keywords
ru: Удалить узлы из резервного списка по ключевым словам

source: Please enter the node keyword, pay attention to distinguish between spaces, uppercase and lowercase.
ru: Введите ключевое слово. Учитывайте регистр и пробелы.

source: Enable Load Balancing
ru: Включить балансировку

source: Console Login Auth
ru: Аутентификация в консоли

source: Console Username
ru: Логин консоли

source: Console Password
ru: Пароль консоли

source: Console Port
ru: Порт консоли

source: In the browser input routing IP plus port access, such as:192.168.1.1:1188
ru: В браузере введите IP роутера и порт, например: 192.168.1.1:1188

source: Haproxy Port
ru: Порт HAProxy

source: Health Check Type
ru: Тип проверки доступности

source: Inner implement
ru: Встроенный механизм

source: Health Check Inter
ru: Интервал проверки состояния

source: When the URL test is used, the load balancing node will be converted into a Socks node. when node list set customizing, must be a Socks node, otherwise the health check will be invalid.
ru: При использовании URL-теста узлы балансировки рассматриваются как SOCKS-узлы. Если список задан вручную, все узлы должны быть типа SOCKS — иначе проверка не будет работать.

source: Add a node, Export Of Multi WAN Only support Multi Wan. Load specific gravity range 1-256. Multiple primary servers can be load balanced, standby will only be enabled when the primary server is offline! Multiple groups can be set, Haproxy port same one for each group.
ru: Добавление узла: функция выбора WAN-интерфейса работает только при нескольких WAN. Вес: 1–256. Несколько основных узлов могут балансироваться, резервные активируются только при отказе основных. Можно создать несколько групп — узлы с одинаковым портом HAProxy объединяются в одну группу.

source: Note that the node configuration parameters for load balancing must be consistent when use TCP health check type, otherwise it cannot be used normally!
ru: Важно: при использовании TCP-проверки параметры узлов в группе балансировки должны совпадать, иначе функция не будет работать корректно.

source: Node Address
ru: Адрес сервера

source: Node address cannot be empty.
ru: Адрес сервера не может быть пустым.

source: Node Port
ru: Порт сервера

source: Node Weight
ru: Вес нагрузки

source: Export Of Multi WAN
ru: Выбор WAN-интерфейса

source: Main
ru: Основной

source: Mode
ru: Режим

source: Primary
ru: Основной

source: Standby
ru: Резервный

source: Check update
ru: Проверить обновления

source: Force update
ru: Принудительное обновление

source: The latest version: %s, currently does not support automatic update, if you need to update, please compile or download the ipk and then manually install.
ru: Доступна версия %s. Автоматическое обновление пока не поддерживается — для установки скачайте или соберите ipk-пакет и установите его вручную.

source: Enable custom URL
ru: Включить пользовательский URL

source: Rule status
ru: Версия правил

source: Manually update
ru: Обновить вручную

source: Rollback
ru: Откатить

source: Rollbacking...
ru: Выполняется откат...
