Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall2.po
Languages: fa

source: Auto
fa: خودکار

source: RUNNING
fa: در حال اجرا

source: NOT RUNNING
fa: متوقف شده

source: Working...
fa: در حال کار...

source: Problem detected!
fa: مشکل شناسایی شد!

source: Touch Check
fa: بررسی اتصال

source: Global
fa: سراسری

source: Kernel Unsupported
fa: هسته پشتیبانی نمی‌شود

source: Basic Settings
fa: تنظیمات پایه

source: Node List
fa: لیست گره‌ها

source: Other Settings
fa: تنظیمات دیگر

source: Load Balancing
fa: توزیع بار

source: Enter interface
fa: رابط ورود

source: Rule Manage
fa: مدیریت قوانین

source: Rule List
fa: لیست قوانین

source: Access control
fa: کنترل دسترسی

source: Watch Logs
fa: مشاهده گزارش‌ها

source: Node Config
fa: پیکربندی گره

source: Running Status
fa: وضعیت اجرا

source: Baidu Connection
fa: اتصال بایدو

source: Google Connection
fa: اتصال گوگل

source: GitHub Connection
fa: اتصال گیت‌هاب

source: Instagram Connection
fa: اتصال اینستاگرام

source: Node Check
fa: بررسی گره

source: Check...
fa: بررسی...

source: Clear
fa: پاک کردن

source: Main switch
fa: سوئیچ اصلی

source: Node
fa: گره

source: Edit Current Node
fa: ویرایش گره فعلی

source: Localhost Proxy
fa: پروکسی میزبان محلی

source: When selected, localhost can transparent proxy.
fa: در صورت انتخاب، میزبان محلی می‌تواند از پروکسی شفاف استفاده کند.

source: Client Proxy
fa: پروکسی کلاینت

source: When selected, devices in LAN can transparent proxy. Otherwise, it will not be proxy. But you can still use access control to allow the designated device to proxy.
fa: در صورت انتخاب، دستگاه‌های شبکه داخلی (LAN) از پروکسی شفاف استفاده می‌کنند. در غیر این صورت، ترافیک آن‌ها از پروکسی عبور نمی‌کند. با این حال، همچنان می‌توانید از طریق کنترل دسترسی به دستگاه‌های خاص اجازه استفاده از پروکسی را بدهید.

source: Missing components, transparent proxy is unavailable.
fa: اجزای مورد نیاز یافت نشد، پروکسی شفاف در دسترس نیست.

source: Socks Config
fa: پیکربندی Socks

source: Socks Node
fa: گره Socks

source: Current Node
fa: گره فعلی

source: Listen Port
fa: پورت شنود

source: 0 is not use
fa: 0 به معنای عدم استفاده است

source: Current node: %s
fa: گره فعلی: %s

source: IP:Port mode acceptable, multi value split with english comma.
fa: حالت IP:Port قابل قبول است، مقادیر متعدد را با کاما انگلیسی جدا کنید.

source: Direct DNS Protocol
fa: پروتکل DNS مستقیم

source: Direct DNS
fa: DNS مستقیم

source: Direct DNS DoH
fa: DNS مستقیم DoH

source: Direct DNS EDNS Client Subnet
fa: زیرشبکه کلاینت EDNS برای DNS مستقیم

source: Remote DNS Protocol
fa: پروتکل DNS راه دور

source: Remote DNS
fa: DNS راه دور

source: Remote DNS DoH
fa: DNS راه دور DoH

source: Remote DNS EDNS Client Subnet
fa: زیرشبکه کلاینت EDNS برای DNS راه دور

source: Notify the DNS server when the DNS query is notified, the location of the client (cannot be a private IP address).
fa: به سرور DNS اطلاع دهید که کلاینت در چه موقعیتی قرار دارد (نمی‌تواند آدرس IP خصوصی باشد).

source: This feature requires the DNS server to support the Edns Client Subnet (RFC7871).
fa: این ویژگی نیازمند پشتیبانی سرور DNS از زیرشبکه کلاینت EDNS (RFC7871) است.

source: Remote DNS Outbound
fa: خروجی DNS راه دور

source: Remote
fa: راه دور

source: Direct
fa: مستقیم

source: Direct Query Strategy
fa: استراتژی پرس‌وجوی مستقیم

source: Remote Query Strategy
fa: استراتژی پرس‌وجوی راه دور

source: Use FakeDNS work in the domain that proxy.
fa: استفاده از FakeDNS در دامنه‌هایی که پروکسی می‌شوند.

source: Suitable scenarios for let the node servers get the target domain names.
fa: سناریوهای مناسب برای اینکه سرورهای گره نام دامنه هدف را دریافت کنند.

source: Such as: DNS unlocking of streaming media, reducing DNS query latency, etc.
fa: مانند: رفع فیلتر DNS رسانه‌های جریانی، کاهش تاخیر پرس‌وجوی DNS و غیره.

source: Domain Override
fa: بازنویسی دامنه

source: Direct DNS result write to IPSet
fa: نتیجه DNS مستقیم در IPSet نوشته شود

source: Perform the matching direct domain name rules into IP to IPSet/NFTSet, and then connect directly (not entering the core).
fa: قوانین نام دامنه مستقیم منطبق را به IP در IPSet/NFTSet تبدیل کرده و سپس مستقیماً متصل شود (بدون ورود به هسته).

source: Maybe conflict with some special circumstances.
fa: ممکن است با برخی شرایط خاص تداخل داشته باشد.

source: DNS Redirect
fa: تغییر مسیر DNS

source: Force special DNS server to need proxy devices.
fa: اجبار دستگاه‌های پروکسی به استفاده از سرور DNS خاص.

source: Clear IPSET
fa: پاک کردن IPSET

source: Clear NFTSET
fa: پاک کردن NFTSET

source: Try this feature if the rule modification does not take effect.
fa: اگر تغییر قوانین تاثیری نداشت، این ویژگی را امتحان کنید.

source: About DNS issues:
fa: درباره مشکلات DNS:

source: Some browsers may have built-in DNS, be sure to close. Example: Chrome. Settings - Security and Privacy - Security - Use secure DNS disabled.
fa: برخی مرورگرها (مانند کروم) ممکن است DNS داخلی داشته باشند؛ لطفاً آن را غیرفعال کنید. مسیر: تنظیمات > امنیت و حریم خصوصی > امنیت > استفاده از DNS امن را غیرفعال کنید.

source: Sometimes after restart, you can not internet. At this time, close all browsers (important), Windows Client, please `ipconfig /flushdns`. Please close the WiFi on the phone, cut the flight mode and then cut back.
fa: گاهی اوقات پس از راه‌اندازی مجدد، دسترسی به اینترنت قطع می‌شود. در این صورت، تمام مرورگرها را ببندید (مهم)، در کلاینت ویندوز دستور `ipconfig /flushdns` را اجرا کنید. وای‌فای گوشی را خاموش و روشن کنید یا حالت پرواز را فعال و غیرفعال نمایید.

source: The client DNS and the default gateway must point to this router.
fa: DNS کلاینت و دروازه پیش‌فرض باید به این روتر اشاره کنند.

source: If you have a wrong DNS process, the consequences are at your own risk!
fa: اگر فرآیند DNS اشتباهی دارید، عواقب آن با خودتان است!

source: Hide menu method, input example in the address bar:
fa: روش مخفی کردن منو، مثال ورودی در نوار آدرس:

source: After the hidden to the display, input example in the address bar:
fa: پس از مخفی شدن برای نمایش، مثال ورودی در نوار آدرس:

source: Are you sure to hide?
fa: آیا مطمئن هستید که مخفی شود؟

source: DNS related issues:
fa: مشکلات مربوط به DNS:

source: Certain browsers such as Chrome have built-in DNS service, which may affect DNS resolution settings. You can go to 'Settings -> Privacy and security -> Use secure DNS' menu to turn it off.
fa: مرورگرهای خاصی مانند Chrome دارای سرویس DNS داخلی هستند که ممکن است بر تنظیمات تفکیک DNS تأثیر بگذارد. می‌توانید به منوی 'تنظیمات -> حریم خصوصی و امنیت -> استفاده از DNS امن' بروید تا آن را خاموش کنید.

source: If you are unable to access the internet after reboot, please try clearing the cache of your terminal devices (make sure to close all open browser application windows first, this step is especially important):
fa: اگر پس از راه‌اندازی مجدد قادر به دسترسی به اینترنت نیستید، لطفاً سعی کنید کش دستگاه‌های نهایی خود را پاک کنید (حتماً ابتدا تمام پنجره‌های برنامه مرورگر باز را ببندید، این مرحله بسیار مهم است):

source: For Windows systems, open Command Prompt and run the command 'ipconfig /flushdns'.
fa: برای سیستم‌های ویندوز، Command Prompt را باز کرده و دستور 'ipconfig /flushdns' را اجرا کنید.

source: For Mac systems, open Terminal and run the command 'sudo killall -HUP mDNSResponder'.
fa: برای سیستم‌های مک، ترمینال را باز کرده و دستور 'sudo killall -HUP mDNSResponder' را اجرا کنید.

source: For mobile devices, you can clear it by reconnecting to the network, such as toggling Airplane Mode and reconnecting to WiFi.
fa: برای دستگاه‌های تلفن همراه، می‌توانید با اتصال مجدد به شبکه، مانند روشن و خاموش کردن حالت هواپیما و اتصال مجدد به وای‌فای، آن را پاک کنید.

source: Please make sure your device's network settings point both the DNS server and default gateway to this router, to ensure DNS queries are properly routed.
fa: لطفاً مطمئن شوید که تنظیمات شبکه دستگاه شما هم سرور DNS و هم دروازه پیش‌فرض را به این روتر ارجاع می‌دهد تا اطمینان حاصل شود که پرس‌وجوهای DNS به درستی هدایت می‌شوند.

source: Browser access:
fa: دسترسی مرورگر:

source: Hide in main menu:
fa: مخفی کردن در منوی اصلی:

source: Show in main menu:
fa: نمایش در منوی اصلی:

source: DNS Export Of Multi WAN
fa: خروجی DNS برای چند WAN

source: Node Export Of Multi WAN
fa: خروجی گره برای چند WAN

source: Only support Multi Wan.
fa: فقط از چند WAN پشتیبانی می‌کند.

source: Not Specify
fa: نامشخص

source: custom
fa: سفارشی

source: If not available, try clearing the cache.
fa: در صورت عدم دسترسی، پاک کردن کش را امتحان کنید.

source: Operation
fa: عملیات

source: Add Node
fa: افزودن گره

source: Add the node via the link
fa: افزودن گره از طریق لینک

source: Enter share links, one per line. Subscription links are not supported!
fa: لینک‌های اشتراک‌گذاری را وارد کنید، هر کدام در یک خط. لینک‌های اشتراک (Subscription) پشتیبانی نمی‌شوند!

source: Please enter the correct link.
fa: لطفاً لینک صحیح را وارد کنید.

source: Clear all nodes
fa: پاک کردن همه گره‌ها

source: Are you sure to clear all nodes?
fa: آیا از پاک کردن همه گره‌ها اطمینان دارید؟

source: Success
fa: موفقیت

source: Error
fa: خطا

source: Delete select nodes
fa: حذف گره‌های انتخاب شده

source: To Top
fa: به بالا

source: Select
fa: انتخاب

source: Selected:
fa: انتخاب شده:

source: DeSelect
fa: لغو انتخاب

source: Select all
fa: انتخاب همه

source: DeSelect all
fa: لغو انتخاب همه

source: Are you sure to delete select nodes?
fa: آیا از حذف گره‌های انتخاب شده اطمینان دارید؟

source: You no select nodes !
fa: شما هیچ گره‌ای انتخاب نکرده‌اید!

source: Are you sure set to
fa: آیا مطمئن هستید که تنظیم شود به

source: the server?
fa: سرور؟

source: You choose node is:
fa: گره انتخابی شما عبارتست از:

source: Timeout
fa: مهلت زمانی

source: Node Remarks
fa: توضیحات گره

source: Add Mode
fa: حالت افزودن

source: Save Order
fa: ذخیره ترتیب

source: Saved current page order successfully.
fa: ترتیب صفحه جاری با موفقیت ذخیره شد.

source: Drag to reorder
fa: برای تغییر ترتیب بکشید

source: Type
fa: نوع

source: _balancing
fa: _توزیع بار

source: _shunt
fa: _شنت (Shunt)

source: Balancing
fa: توزیع بار

source: Node Addition Method
fa: روش افزودن گره

source: Manual
fa: دستی

source: Batch
fa: دسته‌ای

source: Select Group
fa: انتخاب گروه

source: Node Matching Rules
fa: قوانین تطبیق گره

source: Example: <code>^A && B && !C && D$</code><br>This means the node remark must start with A (^), include B, exclude C (!), and end with D ($).<br>Conditions are joined by <code>&&</code>, and their order does not affect the result.
fa: مثال: <code>^A && B && !C && D$</code><br>این بدان معناست که توضیحات گره باید با A شروع شود (^)، شامل B باشد، فاقد C باشد (!)، و با D پایان یابد ($).<br>شرط‌ها با <code>&&</code> به هم متصل می‌شوند و ترتیب آنها تاثیری در نتیجه ندارد.

source: Balancing Strategy
fa: استراتژی توزیع بار

source: Fallback Node
fa: گره پشتیبان

source: Use Custom Probe URL
fa: استفاده از URL پروب سفارشی

source: By default the built-in probe URL will be used, enable this option to use a custom probe URL.
fa: به‌صورت پیش‌فرض از URL پروب داخلی استفاده می‌شود، برای استفاده از URL سفارشی این گزینه را فعال کنید.

source: Probe URL
fa: URL پروب

source: The URL used to detect the connection status.
fa: آدرس URL مورد استفاده برای تشخیص وضعیت اتصال.

source: Probe Interval
fa: فاصله زمانی پروب

source: The interval between initiating probes.
fa: فاصله زمانی بین شروع پروب‌ها.

source: The time format is numbers + units, such as '10s', '2h45m', and the supported time units are <code>s</code>, <code>m</code>, <code>h</code>, which correspond to seconds, minutes, and hours, respectively.
fa: فرمت زمان عدد + واحد است، مانند '10s'، '2h45m'، و واحدهای زمانی پشتیبانی شده <code>s</code>، <code>m</code>، <code>h</code> هستند که به ترتیب ثانیه، دقیقه و ساعت می‌باشند.

source: When the unit is not filled in, it defaults to seconds.
fa: زمانی که واحد پر نشده باشد، پیش‌فرض ثانیه است.

source: Preferred Node Count
fa: تعداد گره‌های ترجیحی

source: The load balancer selects the optimal number of nodes, and traffic is randomly distributed among them.
fa: توزیع‌کننده بار تعداد بهینه‌ای از گره‌ها را انتخاب می‌کند و ترافیک به طور تصادفی بین آن‌ها توزیع می‌شود.

source: Shunt
fa: شنت (Shunt)

source: Preproxy
fa: پیش‌پروکسی

source: Preproxy Node
fa: گره پیش‌پروکسی

source: Set the node to be used as a pre-proxy.
fa: گره را طوری تنظیم کنید که به عنوان پیش پروکسی استفاده شود.

source: Each rule has a separate switch that controls whether this rule uses the pre-proxy or not.
fa: هر قانون یک سوئیچ جداگانه دارد که کنترل می‌کند آیا این قانون از پیش-پروکسی استفاده می‌کند یا خیر.

source: Close (Not use)
fa: بستن (عدم استفاده)

source: Use default node
fa: استفاده از گره پیش‌فرض

source: Direct Connection
fa: اتصال مستقیم

source: Blackhole (Block)
fa: سیاه‌چاله (مسدودسازی)

source: There are no available nodes, please add or subscribe nodes first.
fa: هیچ گره در دسترس نیست، لطفاً ابتدا گره‌ها را اضافه یا مشترک شوید.

source: No shunt rules? Click me to go to add.
fa: قانون شنتی وجود ندارد؟ برای افزودن اینجا کلیک کنید.

source: When using, localhost will connect this node first and then use this node to connect the default node.
fa: در صورت استفاده، میزبان محلی ابتدا به این گره متصل شده و سپس از این گره برای اتصال به گره پیش‌فرض استفاده می‌کند.

source: Domain Strategy
fa: استراتژی دامنه

source: Domain matcher
fa: تتطبیق‌دهنده دامنه

source: 'AsIs': Only use domain for routing. Default value.
fa: 'AsIs': فقط استفاده از دامنه برای مسیریابی. مقدار پیش‌فرض.

source: 'IPIfNonMatch': When no rule matches current domain, resolves it into IP addresses (A or AAAA records) and try all rules again.
fa: 'IPIfNonMatch': زمانی که هیچ قانونی با دامنه فعلی مطابقت ندارد، آن را به آدرس‌های IP (رکوردهای A یا AAAA) حل می‌کند و تمام قوانین را دوباره امتحان می‌کند.

source: 'IPOnDemand': As long as there is a IP-based rule, resolves the domain into IP immediately.
fa: 'IPOnDemand': تا زمانی که یک قانون مبتنی بر IP وجود داشته باشد، بلافاصله دامنه را به IP حل می‌کند.

source: Load balancing node list
fa: لیست گره‌های توزیع بار

source: Load balancing node list, <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>document</a>
fa: لیست گره‌های توزیع بار، <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>مستندات</a>

source: From Share URL
fa: از لینک اشتراک‌گذاری

source: Build Share URL
fa: ساخت لینک اشتراک‌گذاری

source: Generate QRCode
fa: تولید کد QR

source: Export Config File
fa: خروجی فایل پیکربندی

source: Import Finished
fa: وارد کردن پایان یافت

source: Not a supported scheme:
fa: طرح پشتیبانی نشده:

source: Invalid Share URL Format
fa: فرمت لینک اشتراک‌گذاری نامعتبر

source: Paste Share URL Here
fa: لینک اشتراک‌گذاری را اینجا جایگذاری کنید

source: Share URL to clipboard unable.
fa: کپی لینک اشتراک‌گذاری در کلیپ‌بورد ناموفق بود.

source: Share URL to clipboard successfully.
fa: لینک اشتراک‌گذاری با موفقیت در کلیپ‌بورد کپی شد.

source: Faltal on get option, please help in debug:
fa: خطای مهلک در دریافت گزینه، لطفاً در اشکال‌زدایی کمک کنید:

source: Faltal on set option, please help in debug:
fa: خطای مهلک در تنظیم گزینه، لطفاً در اشکال‌زدایی کمک کنید:

source: Address
fa: آدرس

source: Address (Support Domain Name)
fa: آدرس (پشتیبانی از نام دامنه)

source: Trojan Verify Cert
fa: تایید گواهی Trojan

source: Trojan Cert Path
fa: مسیر گواهی Trojan

source: Finger Print
fa: اثر انگشت (Fingerprint)

source: Avoid using randomized, unless you have to.
fa: از استفاده از تصادفی خودداری کنید، مگر اینکه مجبور باشید.

source: Original
fa: اصلی

source: Transport Plugin
fa: افزونه انتقال

source: Shadowsocks secondary encryption
fa: رمزنگاری ثانویه Shadowsocks

source: Obfs Type
fa: نوع مبهم‌سازی (Obfs)

source: Obfs Password
fa: رمز عبور مبهم‌سازی

source: Auth Type
fa: نوع احراز هویت

source: Auth Password
fa: رمز عبور احراز هویت

source: Commands the client to use the BBR flow control algorithm
fa: به کلاینت دستور می‌دهد تا از الگوریتم کنترل جریان BBR استفاده کند

source: Certificate fingerprint
fa: اثر انگشت گواهی

source: Max upload Mbps
fa: حداکثر آپلود (Mbps)

source: Max download Mbps
fa: حداکثر دانلود (Mbps)

source: QUIC stream receive window
fa: پنجره دریافت جریان QUIC

source: QUIC connection receive window
fa: پنجره دریافت اتصال QUIC

source: QUIC concurrent bidirectional streams
fa: جریان‌های دوطرفه همزمان QUIC

source: Disable MTU detection
fa: غیرفعال کردن تشخیص MTU

source: ignoreClientBandwidth
fa: نادیده گرفتن پهنای باند کلاینت

source: Lazy Start
fa: شروع تنبل (Lazy Start)

source: Encrypt Method
fa: روش رمزنگاری

source: Encrypt Key
fa: کلید رمزنگاری

source: Latency
fa: تاخیر

source: Automatic detection delay
fa: تاخیر تشخیص خودکار

source: Show server address and port
fa: نمایش آدرس و پورت سرور

source: URL Test Address
fa: آدرس تست URL

source: URL Test
fa: تست URL

source: Test
fa: تست

source: Node num
fa: شماره گره

source: Self add
fa: افزودن خودکار

source: Apply
fa: اعمال

source: Use
fa: استفاده

source: Copy
fa: کپی

source: Delay Settings
fa: تنظیمات تاخیر

source: Open and close Daemon
fa: باز و بسته کردن دیمن (Daemon)

source: Delay Start
fa: شروع با تاخیر

source: Units:seconds
fa: واحد: ثانیه

source: Units:minutes
fa: واحد: دقیقه

source: stop automatically mode
fa: حالت توقف خودکار

source: stop Time(Every day)
fa: زمان توقف (هر روز)

source: stop Interval(Hour)
fa: بازه توقف (ساعت)

source: start automatically mode
fa: حالت شروع خودکار

source: start Time(Every day)
fa: زمان شروع (هر روز)

source: start Interval(Hour)
fa: بازه شروع (ساعت)

source: restart automatically mode
fa: حالت راه‌اندازی مجدد خودکار

source: restart Time(Every day)
fa: زمان راه‌اندازی مجدد (هر روز)

source: restart Interval(Hour)
fa: بازه راه‌اندازی مجدد (ساعت)

source: Forwarding Settings
fa: تنظیمات فورواردینگ

source: TCP No Redir Ports
fa: پورت‌های بدون تغییر مسیر TCP

source: UDP No Redir Ports
fa: پورت‌های بدون تغییر مسیر UDP

source: Fill in the ports you don't want to be forwarded by the agent, with the highest priority.
fa: پورت‌هایی را که نمی‌خواهید توسط نماینده فوروارد شوند، با بالاترین اولویت وارد کنید.

source: If you don't want to let the device in the list to go proxy, please choose all.
fa: اگر نمی‌خواهید دستگاه موجود در لیست پروکسی شود، لطفاً همه را انتخاب کنید.

source: The port settings support single ports and ranges.<br>Separate multiple ports with commas (,).<br>Example: 21,80,443,1000:2000.
fa: تنظیمات پورت از پورت‌های تکی و بازه‌ها پشتیبانی می‌کند.<br>پورت‌های متعدد را با کاما (,) جدا کنید.<br>مثال: 21,80,443,1000:2000.

source: TCP Proxy Drop Ports
fa: پورت‌های حذف پروکسی TCP

source: UDP Proxy Drop Ports
fa: پورت‌های حذف پروکسی UDP

source: TCP Redir Ports
fa: پورت‌های تغییر مسیر TCP

source: UDP Redir Ports
fa: پورت‌های تغییر مسیر UDP

source: No patterns are used
fa: هیچ الگویی استفاده نشده است

source: All
fa: همه

source: Common Use
fa: استفاده متداول

source: Only Web
fa: فقط وب

source: or more
fa: یا بیشتر

source: or less
fa: یا کمتر

source: Default
fa: پیش‌فرض

source: Close
fa: بستن

source: Hijacking ICMP (PING)
fa: ربودن ICMP (PING)

source: Hijacking ICMPv6 (IPv6 PING)
fa: ربودن ICMPv6 (IPv6 PING)

source: Sniffing
fa: شنود (Sniffing)

source: TCP Proxy Way
fa: روش پروکسی TCP

source: Auto Switch
fa: سوئیچ خودکار

source: When there is no server, an automatic reconnect scheme is used
fa: زمانی که هیچ سروری وجود ندارد، از طرح اتصال مجدد خودکار استفاده می‌شود

source: How often to test
fa: هر چند وقت یکبار تست شود

source: Timeout seconds
fa: ثانیه‌های مهلت زمانی

source: Timeout retry num
fa: تعداد تلاش مجدد مهلت زمانی

source: Automatic switching cannot be used when this option is checked
fa: زمانی که این گزینه تیک خورده باشد، نمی‌توان از سوئیچینگ خودکار استفاده کرد

source: Main node
fa: گره اصلی

source: List of backup nodes
fa: لیست گره‌های پشتیبان

source: Restore Switch
fa: سوئیچ بازگردانی

source: When detects main node is available, switch back to the main node.
fa: زمانی که در دسترس بودن گره اصلی تشخیص داده شود، به گره اصلی بازگردانده می‌شود.

source: Add nodes to the standby node list by keywords
fa: افزودن گره‌ها به لیست گره‌های آماده‌به‌کار با استفاده از کلمات کلیدی

source: Delete nodes in the standby node list by keywords
fa: حذف گره‌ها در لیست گره‌های آماده‌به‌کار با استفاده از کلمات کلیدی

source: Please enter the node keyword, pay attention to distinguish between spaces, uppercase and lowercase.
fa: لطفاً کلمه کلیدی گره را وارد کنید، به تمایز بین فاصله، حروف بزرگ و کوچک توجه کنید.

source: Enable Load Balancing
fa: فعال‌سازی توزیع بار

source: Console Login Auth
fa: احراز هویت ورود به کنسول

source: Console Username
fa: نام کاربری کنسول

source: Console Password
fa: رمز عبور کنسول

source: Console Port
fa: پورت کنسول

source: In the browser input routing IP plus port access, such as:192.168.1.1:1188
fa: در مرورگر IP مسیریابی به همراه پورت را وارد کنید، مانند: 192.168.1.1:1188

source: Haproxy Port
fa: پورت Haproxy

source: Health Check Type
fa: نوع بررسی سلامت

source: Inner implement
fa: پیاده‌سازی داخلی

source: Health Check Inter
fa: بازه بررسی سلامت

source: When the URL test is used, the load balancing node will be converted into a Socks node. when node list set customizing, must be a Socks node, otherwise the health check will be invalid.
fa: زمانی که تست URL استفاده می‌شود، گره توزیع بار به یک گره Socks تبدیل می‌شود. زمانی که لیست گره‌ها به صورت سفارشی تنظیم شده باشد، باید یک گره Socks باشد، در غیر این صورت بررسی سلامت نامعتبر خواهد بود.

source: Add a node, Export Of Multi WAN Only support Multi Wan. Load specific gravity range 1-256. Multiple primary servers can be load balanced, standby will only be enabled when the primary server is offline! Multiple groups can be set, Haproxy port same one for each group.
fa: افزودن گره، خروجی چند WAN تنها از چند WAN پشتیبانی می‌کند. محدوده وزن خاص بار 1-256. چندین سرور اصلی می‌توانند توزیع بار شوند، حالت آماده‌به‌کار تنها زمانی فعال می‌شود که سرور اصلی آفلاین باشد! چندین گروه قابل تنظیم است، پورت Haproxy برای هر گروه یکسان است.

source: Note that the node configuration parameters for load balancing must be consistent when use TCP health check type, otherwise it cannot be used normally!
fa: توجه داشته باشید که پارامترهای پیکربندی گره برای توزیع بار باید در صورت استفاده از نوع بررسی سلامت TCP یکسان باشند، در غیر این صورت نمی‌توان از آن به درستی استفاده کرد!

source: Node Address
fa: آدرس گره

source: Node address cannot be empty.
fa: آدرس گره نمی‌تواند خالی باشد.

source: Node Port
fa: پورت گره

source: Node Weight
fa: وزن گره

source: Export Of Multi WAN
fa: خروجی چند WAN

source: Main
fa: اصلی

source: Mode
fa: حالت

source: Primary
fa: اولیه

source: Standby
fa: آماده‌به‌کار

source: Check update
fa: بررسی به‌روزرسانی

source: Force update
fa: به‌روزرسانی اجباری

source: The latest version: %s, currently does not support automatic update, if you need to update, please compile or download the ipk and then manually install.
fa: آخرین نسخه: %s، در حال حاضر از به‌روزرسانی خودکار پشتیبانی نمی‌کند، اگر نیاز به به‌روزرسانی دارید، لطفاً کامپایل کنید یا فایل ipk را دانلود و سپس دستی نصب کنید.

source: Enable custom URL
fa: فعال‌سازی URL سفارشی

source: Rule status
fa: وضعیت رول

source: Manually update
fa: به‌روزرسانی دستی

source: Rollback
fa: بازگردانی

source: Rollbacking...
fa: در حال بازگردانی...

source: Enable auto update rules
fa: فعال‌سازی به‌روزرسانی خودکار قوانین

source: Update Time(every day)
fa: زمان به‌روزرسانی (هر روز)

source: Update Interval(hour)
fa: بازه به‌روزرسانی (ساعت)

source: Update Mode
fa: حالت به‌روزرسانی

source: Loop Mode
fa: حالت حلقه

source: Every day
fa: هر روز

source: Every Monday
fa: هر دوشنبه

source: Every Tuesday
fa: هر سه‌شنبه

source: Every Wednesday
fa: هر چهارشنبه

source: Every Thursday
fa: هر پنج‌شنبه

source: Every Friday
fa: هر جمعه

source: Every Saturday
fa: هر شنبه

source: Every Sunday
fa: هر یکشنبه

source: hour
fa: ساعت

source: Hour
fa: ساعت

source: GeoIP Update URL
fa: URL به‌روزرسانی GeoIP

source: Geosite Update URL
fa: URL به‌روزرسانی Geosite

source: Location of Geo rule files
fa: مکان فایل‌های قوانین Geo
