Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall2.po
Languages: fa

source: Fragmented packet length (byte)
fa: طول بسته قطعه‌بندی شده (بایت)

source: Fragment Interval
fa: بازه قطعه‌بندی

source: Fragmentation interval (ms)
fa: بازه قطعه‌بندی (میلی‌ثانیه)

source: Max Split
fa: حداکثر تقسیم

source: Limit the maximum number of splits.
fa: محدود کردن حداکثر تعداد تقسیم‌ها.

source: Split handshake data into multiple TLS records for better censorship evasion. Low overhead. Recommended to enable first.
fa: تقسیم داده‌های دست تکان دادن به چندین رکورد TLS برای فرار بهتر از سانسور. سربار کم. توصیه می‌شود ابتدا فعال شود.

source: Split handshake into multiple TCP segments. Enhances obfuscation. May increase delay. Use only if needed.
fa: تقسیم دست تکان دادن به چندین قطعه TCP. افزایش مبهم‌سازی. ممکن است تاخیر را افزایش دهد. فقط در صورت نیاز استفاده کنید.

source: Noise
fa: نویز (Noise)

source: UDP noise, Under some circumstances it can bypass some UDP based protocol restrictions.
fa: نویز UDP، در برخی شرایط می‌تواند محدودیت‌های پروتکل مبتنی بر UDP را دور بزند.

source: To send noise packets, select "Noise" in Xray Settings.
fa: برای ارسال بسته‌های نویز، "Noise" را در تنظیمات Xray انتخاب کنید.

source: Xray Noise Packets
fa: بسته‌های نویز Xray

source: Packet
fa: بسته

source: Delay (ms)
fa: تاخیر (میلی‌ثانیه)

source: IP Type
fa: نوع IP

source: If is domain name, The requested domain name will be resolved to IP before connect.
fa: اگر نام دامنه است، نام دامنه درخواست شده قبل از اتصال به IP حل می‌شود.

source: Chain Proxy
fa: پروکسی زنجیره‌ای

source: Landing Node
fa: گره فرود (Landing Node)

source: Only support a layer of proxy.
fa: فقط از یک لایه پروکسی پشتیبانی می‌کند.

source: Chained proxy works only with Xray or Sing-box nodes.<br>You can only use manual or imported nodes as chained nodes.
fa: پروکسی زنجیره‌ای فقط با گره‌های Xray یا Sing-box کار می‌کند.<br>شما فقط می‌توانید از گره‌های دستی یا وارد شده به عنوان گره‌های زنجیره‌ای استفاده کنید.

source: Set the default domain resolution strategy for the sing-box node.
fa: تنظیم استراتژی پیش‌فرض حل دامنه برای گره sing-box.

source: Prefer IPv4
fa: ترجیح IPv4

source: Prefer IPv6
fa: ترجیح IPv6

source: IPv4 Only
fa: فقط IPv4

source: IPv6 Only
fa: فقط IPv6

source: Maintain
fa: نگهداری

source: Backup and Restore
fa: پشتیبان‌گیری و بازیابی

source: Backup or Restore Client and Server Configurations.
fa: پشتیبان‌گیری یا بازیابی پیکربندی‌های کلاینت و سرور.

source: Note: Restoring configurations across different versions may cause compatibility issues.
fa: توجه: بازیابی پیکربندی‌ها در بین نسخه‌های مختلف ممکن است باعث مشکلات سازگاری شود.

source: Create Backup File
fa: ایجاد فایل پشتیبان

source: Restore Backup File
fa: بازیابی فایل پشتیبان

source: DL Backup
fa: دانلود پشتیبان

source: RST Backup
fa: بازنشانی پشتیبان

source: Backup failed!
fa: پشتیبان‌گیری ناموفق بود!

source: UL Restore
fa: آپلود بازیابی

source: CLOSE WIN
fa: بستن پنجره

source: Restore to default configuration
fa: بازیابی به پیکربندی پیش‌فرض

source: Do Reset
fa: انجام بازنشانی

source: Please select a file first.
fa: لطفاً ابتدا یک فایل انتخاب کنید.

source: Invalid file type. Please upload a .tar.gz file.
fa: نوع فایل نامعتبر است. لطفاً یک فایل .tar.gz آپلود کنید.

source: File size exceeds 10MB limit.
fa: اندازه فایل از محدودیت 10 مگابایت بیشتر است.

source: Do you want to restore the client to default settings?
fa: آیا می‌خواهید کلاینت را به تنظیمات پیش‌فرض بازگردانید؟

source: Are you sure you want to restore the client to default settings?
fa: آیا مطمئن هستید که می‌خواهید کلاینت را به تنظیمات پیش‌فرض بازگردانید؟

source: Configuration file uploaded successfully…
fa: فایل پیکربندی با موفقیت آپلود شد...

source: Configuration restored successfully…
fa: پیکربندی با موفقیت بازیابی شد...

source: Service restarting…
fa: راه اندازی مجدد سرویس...

source: Configuration file decompression failed, please try again!
fa: استخراج فایل پیکربندی ناموفق بود، لطفاً دوباره تلاش کنید!

source: _urltest
fa: _تست URL

source: URLTest node list
fa: لیست گره‌های URLTest

source: List of nodes to test, <a target='_blank' href='https://sing-box.sagernet.org/configuration/outbound/urltest'>document</a>
fa: لیست گره‌ها برای تست، <a target='_blank' href='https://sing-box.sagernet.org/configuration/outbound/urltest'>مستندات</a>

source: Test interval
fa: بازه تست

source: Test interval must be less or equal than idle timeout.
fa: بازه تست باید کمتر یا مساوی مهلت زمانی بیکاری باشد.

source: Test tolerance
fa: تحمل تست

source: The test tolerance in milliseconds.
fa: تحمل تست بر حسب میلی‌ثانیه.

source: Idle timeout
fa: مهلت زمانی بیکاری

source: The idle timeout.
fa: مهلت زمانی بیکاری.

source: Interrupt existing connections
fa: قطع اتصالات موجود

source: Interrupt existing connections when the selected outbound has changed.
fa: قطع اتصالات موجود زمانی که خروجی انتخاب شده تغییر کرده است.

source: Port hopping range
fa: محدوده پرش پورت

source: Format as 1000:2000 or 1000-2000 Multiple groups are separated by commas (,).
fa: فرمت به صورت 1000:2000 یا 1000-2000 گروه‌های متعدد با کاما (,) جدا می‌شوند.

source: Use Custom Config
fa: استفاده از پیکربندی سفارشی

source: Custom Config
fa: پیکربندی سفارشی

source: Must be JSON text!
fa: باید متن JSON باشد!

source: Geo View
fa: نمای Geo

source: Query
fa: پرس‌وجو

source: Querying
fa: در حال پرس‌وجو

source: Please enter query content!
fa: لطفاً محتوای پرس‌وجو را وارد کنید!

source: No results were found!
fa: هیچ نتیجه‌ای یافت نشد!

source: Rules containing this value:
fa: قوانین حاوی این مقدار:

source: Domain/IP Query
fa: پرس‌وجوی دامنه/IP

source: GeoIP/Geosite Query
fa: پرس‌وجوی GeoIP/Geosite

source: Enter a domain or IP to query the Geo rule list they belong to.
fa: یک دامنه یا IP وارد کنید تا لیست قوانین Geo که به آن تعلق دارند را جستجو کنید.

source: Enter a GeoIP or Geosite to extract the domains/IPs they contain. Format: geoip:cn or geosite:gfw
fa: یک GeoIP یا Geosite وارد کنید تا دامنه‌ها/IPهای موجود در آن استخراج شوند. فرمت: geoip:cn یا geosite:gfw

source: Tips:
fa: نکات:

source: By entering a domain or IP, you can query the Geo rule list they belong to.
fa: با وارد کردن یک دامنه یا IP، می‌توانید لیست قوانین Geo که به آن تعلق دارند را جستجو کنید.

source: By entering a GeoIP or Geosite, you can extract the domains/IPs they contain.
fa: با وارد کردن یک GeoIP یا Geosite، می‌توانید دامنه‌ها/IPهای موجود در آن را استخراج کنید.

source: Use the GeoIP/Geosite query function to verify if the entered Geo rules are correct.
fa: از عملکرد پرس‌وجوی GeoIP/Geosite برای تأیید صحت قوانین Geo وارد شده استفاده کنید.

source: Private Key Passphrase
fa: عبارت عبور کلید خصوصی

source: Host Key
fa: کلید میزبان (Host Key)

source: Accept any if empty.
fa: در صورت خالی بودن، همه پذیرفته می‌شوند.

source: Host Key Algorithms
fa: الگوریتم‌های کلید میزبان

source: Client Version
fa: نسخه کلاینت

source: Random version will be used if empty.
fa: در صورت خالی بودن، از نسخه تصادفی استفاده می‌شود.

source: The configured type also applies to the core specified when manually importing nodes.
fa: نوع پیکربندی شده همچنین به هسته مشخص شده هنگام وارد کردن دستی گره‌ها اعمال می‌شود.

source: Group Name
fa: نام گروه

source: Reassign Group
fa: تغییر گروه

source: Reassign Node Group
fa: تغییر گروه گره

source: Search nodes...
fa: جستجوی گره‌ها...

source: Using...
fa: در حال استفاده...

source: Generate configuration file and run
fa: تولید فایل پیکربندی و اجرا

source: Start after a delay of %s seconds!
fa: شروع پس از تاخیر %s ثانیه‌ای!

source: The script is already running, do not run it again. Exit.
fa: اسکریپت در حال اجرا است، دوباره آن را اجرا نکنید. خروج.

source: Stop the script and wait for a timeout, then exit without repeating the process.
fa: توقف اسکریپت و انتظار برای مهلت زمانی، سپس خروج بدون تکرار فرآیند.

source: Warning: The %s application environment is incomplete. Switch to %s. (%s)
fa: هشدار: محیط برنامه %s ناقص است. سوئیچ به %s. (%s)

source: Note: Dnsmasq (%s) is below 2.90. Upgrading is recommended to improve stability.
fa: توجه: Dnsmasq (%s) کمتر از 2.90 است. ارتقا برای بهبود پایداری توصیه می‌شود.

source: Warning: %s transparent proxy is missing basic dependency %s!
fa: هشدار: پروکسی شفاف %s وابستگی اساسی %s را ندارد!

source: Warning: Not compatible with any transparent proxy system environment.
fa: هشدار: با هیچ محیط سیستم پروکسی شفاف سازگار نیست.

source: %s does not have execute permissions and cannot be started: %s %s
fa: %s مجوز اجرا ندارد و نمی‌تواند شروع شود: %s %s

source: %s not found, unable to start...
fa: %s پیدا نشد، شروع امکان‌پذیر نیست...

source: Socks node: [%s]%s is an invalid server address and cannot be started!
fa: گره Socks: [%s]%s یک آدرس سرور نامعتبر است و نمی‌تواند شروع شود!

source: For some reason, the configuration for this Socks service has been lost, and its startup has been aborted!
fa: به دلایلی، پیکربندی این سرویس Socks از بین رفته است و راه‌اندازی آن لغو شد!

source: Socks node: [%s]%s, start failed %s:%s %s
fa: گره Socks: [%s]%s، شروع ناموفق %s:%s %s

source: Socks node: [%s]%s, starting %s:%s
fa: گره Socks: [%s]%s، در حال شروع %s:%s

source: To enable experimental IPv6 transparent proxy (TProxy), please ensure your node and type support IPv6!
fa: برای فعال‌سازی پروکسی شفاف IPv6 (آزمایشی)، لطفاً اطمینان حاصل کنید که گره و نوع اتصال شما از IPv6 پشتیبانی می‌کند!

source: [%s] process %s error, skip this transparent proxy!
fa: خطای فرآیند [%s] %s، از این پروکسی شفاف صرف‌نظر کنید!

source: Analyzing the node configuration of the Socks service...
fa: تحلیل پیکربندی گره سرویس Socks...

source: Log file is too long, clear it!
fa: فایل گزارش خیلی طولانی است، آن را پاک کنید!

source: The task is currently running automatically as a scheduled task; no reconfiguration of the scheduled task is required.
fa: وظیفه در حال حاضر به طور خودکار به عنوان یک وظیفه زمان‌بندی شده اجرا می‌شود؛ نیازی به پیکربندی مجدد وظیفه زمان‌بندی شده نیست.

source: Scheduled tasks: Auto stop service.
fa: وظایف زمان‌بندی شده: توقف خودکار سرویس.

source: Scheduled tasks: Auto start service.
fa: وظایف زمان‌بندی شده: شروع خودکار سرویس.

source: Scheduled tasks: Auto restart service.
fa: وظایف زمان‌بندی شده: راه‌اندازی مجدد خودکار سرویس.

source: Scheduled tasks: Auto update rules.
fa: وظایف زمان‌بندی شده: به‌روزرسانی خودکار قوانین.

source: Scheduled tasks: Auto update [%s] subscription.
fa: وظایف زمان‌بندی شده: به‌روزرسانی خودکار اشتراک [%s].

source: Auto updates: Starts a cyclical update process.
fa: به‌روزرسانی‌های خودکار: شروع یک فرآیند به‌روزرسانی چرخشی.

source: Running in no proxy mode, it only allows scheduled tasks for starting and stopping services.
fa: در حالت بدون پروکسی اجرا می‌شود، فقط اجازه وظایف زمان‌بندی شده برای شروع و توقف سرویس‌ها را می‌دهد.

source: Clear scheduled commands.
fa: پاک کردن دستورات زمان‌بندی شده.

source: Unable to resolve [%s], route table addition failed!
fa: عدم توانایی در حل [%s]، افزودن به جدول مسیریابی ناموفق بود!

source: [%s] was successfully added to the routing table of interface [%s]!
fa: [%s] با موفقیت به جدول مسیریابی رابط [%s] اضافه شد!

source: Adding [%s] to the [%s] routing table failed! The reason is that the [%s] gateway cannot be found.
fa: افزودن [%s] به جدول مسیریابی [%s] ناموفق بود! دلیل این است که دروازه [%s] پیدا نمی‌شود.

source: Global nodes are not enabled, skip [%s].
fa: گره‌های سراسری فعال نیستند، صرف‌نظر از [%s].

source: Direct DNS: %s
fa: DNS مستقیم: %s

source: Remote DNS: %s
fa: DNS راه دور: %s

source: The program has started. Please stop it and then restart it!
fa: برنامه شروع شده است. لطفاً آن را متوقف و سپس دوباره راه‌اندازی کنید!

source: Running complete!
fa: اجرا کامل شد!

source: Clearing and closing related programs and cache complete.
fa: پاک‌سازی و بستن برنامه‌های مرتبط و کش کامل شد.

source: Incorrect index listing method (%s), execution terminated!
fa: روش فهرست‌بندی ایندکس نادرست (%s)، اجرا متوقف شد!

source: parse the traffic splitting rules[%s]-[geoip:%s] add to %s to complete.
fa: تجزیه قوانین تقسیم ترافیک [%s]-[geoip:%s] و افزودن به %s کامل شد.

source: Access Control:
fa: کنترل دسترسی:

source: Add node to the load balancer is directly connected to %s[%s].
fa: افزودن گره به توزیع‌کننده بار مستقیماً به %s[%s] متصل است.

source: Add all %s nodes to %s[%s] direct connection complete.
fa: افزودن تمام گره‌های %s به %s[%s] اتصال مستقیم کامل شد.

source: Starting to load %s firewall rules...
fa: شروع بارگذاری قوانین فایروال %s...

source: local network segments (%s) direct connection: %s
fa: بخش‌های شبکه محلی (%s) اتصال مستقیم: %s

source: Add ISP %s DNS to the whitelist: %s
fa: افزودن DNS ISP %s به لیست سفید: %s

source: Source iface [%s],
fa: رابط منبع [%s]،

source: IP range [%s],
fa: محدوده IP [%s]،

source: All device,
fa: همه دستگاه‌ها،

source: Does not exist, ignore.
fa: وجود ندارد، نادیده گرفتن.

source: not proxy %s port [%s]
fa: پروکسی نکردن پورت %s [%s]

source: not proxy all %s
fa: پروکسی نکردن همه %s

source: Use the %s node [%s]
fa: استفاده از گره %s [%s]

source: Using a node that is different from the global configuration, DNS has been forcibly redirected to a dedicated DNS server.
fa: استفاده از گره‌ای متفاوت از پیکربندی سراسری، DNS به اجبار به سرور DNS اختصاصی هدایت شده است.

source: Add direct DNS to %s: %s
fa: افزودن DNS مستقیم به %s: %s

source: Local
fa: محلی

source: [Local],
fa: [محلی]،

source: Clear %s.
fa: پاک کردن %s.

source: Delete %s rules is complete.
fa: حذف قوانین %s کامل شد.

source: %s firewall rules load complete!
fa: بارگذاری قوانین فایروال %s کامل شد!

source: Socks switch detection: Unknown error.
fa: تشخیص سوئیچ Socks: خطای ناشناخته.

source: Socks switch detection: Unable to connect to the network. Please check if the network is working properly!
fa: تشخیص سوئیچ Socks: عدم توانایی در اتصال به شبکه. لطفاً بررسی کنید که شبکه به درستی کار می‌کند!

source: Socks switch detection: Primary node 【%s: [%s]】 is normal. Switch to the primary node!
fa: تشخیص سوئیچ Socks: گره اولیه 【%s: [%s]】 عادی است. سوئیچ به گره اولیه!

source: Socks switch detection: %s node switch complete!
fa: تشخیص سوئیچ Socks: سوئیچ گره %s کامل شد!

source: Socks switch detection: %s 【%s:[%s]】 normal.
fa: تشخیص سوئیچ Socks: %s 【%s:[%s]】 عادی است.

source: switch to %s test detect!
fa: سوئیچ به تست تشخیص %s!

source: backup node
fa: گره پشتیبان

source: next backup node
fa: گره پشتیبان بعدی

source: main node
fa: گره اصلی

source: Socks switch detection: %s 【%s:[%s]】 abnormal, %s
fa: تشخیص سوئیچ Socks: %s 【%s:[%s]】 غیرعادی، %s

source: Socks switch detection: %s 【%s:[%s]】 normal, switch to this node!
fa: تشخیص سوئیچ Socks: %s 【%s:[%s]】 عادی، سوئیچ به این گره!

source: Restart dnsmasq service.
fa: راه‌اندازی مجدد سرویس dnsmasq.

source: Console Port: %s
fa: پورت کنسول: %s

source: Discard one obviously invalid node.
fa: حذف یک گره به وضوح نامعتبر.

source: Entrance %s:%s
fa: ورودی %s:%s

source: Node: %s:%s, Weight: %s
fa: گره: %s:%s، وزن: %s

source: Start updating the rules...
fa: شروع به‌روزرسانی قوانین...

source: Download file size verification error. Original file size: %sB. Downloaded file size: %sB.
fa: خطای تأیید اندازه فایل دانلود شده. اندازه فایل اصلی: %sB. اندازه فایل دانلود شده: %sB.

source: Downloaded file is empty or an error occurred while reading it.
fa: فایل دانلود شده خالی است یا خطایی هنگام خواندن آن رخ داده است.

source: %s Start updating...
fa: %s شروع به‌روزرسانی...

source: %s version is the same and does not need to be updated.
fa: نسخه %s یکسان است و نیازی به به‌روزرسانی ندارد.

source: %s an error occurred during the file download process. Please try downloading again.
fa: %s خطایی در فرآیند دانلود فایل رخ داد. لطفاً دوباره تلاش کنید.

source: %s an error occurred while downloading the file. Please check your network or the download link and try again!
fa: %s خطایی هنگام دانلود فایل رخ داد. لطفاً شبکه یا لینک دانلود را بررسی کرده و دوباره تلاش کنید!

source: %s update success.
fa: %s به‌روزرسانی موفق.

source: %s update failed, please try again later or change URL.
fa: %s به‌روزرسانی ناموفق بود، لطفاً بعداً تلاش کنید یا URL را تغییر دهید.

source: %s update error!
fa: %s خطای به‌روزرسانی!

source: Restart the service and apply the new rules.
fa: راه‌اندازی مجدد سرویس و اعمال قوانین جدید.

source: The rules have been updated...
fa: قوانین به‌روز شده‌اند...

source: Socks node list [%s]
fa: لیست گره‌های Socks [%s]

source: Backup node list
fa: لیست گره‌های پشتیبان

source: HAProxy node list [%s]
fa: لیست گره‌های HAProxy [%s]

source: ACL list [%s]
fa: لیست ACL [%s]

source: Shunt [%s] node
fa: گره شنت [%s]

source: Xray Load Balancing node [%s] list
fa: لیست گره‌های توزیع بار Xray [%s]

source: Xray Load Balancing node [%s] backup node
fa: گره پشتیبان گره توزیع بار Xray [%s]

source: Sing-Box URLTest node [%s] list
fa: لیست گره‌های URLTest Sing-Box [%s]

source: Node [%s] preproxy node
fa: گره پیش‌پروکسی گره [%s]

source: Node [%s] landing node
fa: گره فرود گره [%s]

source: Skipping the %s node is due to incompatibility with the %s core program or incorrect node usage type settings.
fa: نادیده گرفتن گره %s به دلیل ناسازگاری با هسته برنامه %s یا تنظیمات نادرست نوع گره.

source: Skip node: %s. Because Sing-Box does not support the %s protocol's %s transmission method, Xray needs to be used instead.
fa: صرف‌نظر از گره: %s. زیرا Sing-Box از روش انتقال %s پروتکل %s پشتیبانی نمی‌کند، باید به جای آن از Xray استفاده شود.

source: Xray unsupport %s plugin.
fa: Xray از افزونه %s پشتیبانی نمی‌کند.

source: Plugin options Incomplete.
fa: گزینه‌های افزونه ناقص است.

source: shadowsocks-libev unsupport 2022 encryption.
fa: shadowsocks-libev از رمزنگاری 2022 پشتیبانی نمی‌کند.

source: Please replace Xray or Sing-Box to support more transmission methods in Shadowsocks.
fa: لطفاً برای پشتیبانی از روش‌های انتقال بیشتر در Shadowsocks، از Xray یا Sing-Box استفاده کنید.

source: unsupport %s plugin.
fa: پشتیبانی نکردن از افزونه %s.

source: Skip the %s node because the %s core program is not installed.
fa: صرف‌نظر از گره %s زیرا برنامه اصلی %s نصب نشده است.

source: Skip the %s node, as %s type nodes require Sing-Box version 1.12 or higher.
fa: صرف‌نظر از گره %s، زیرا گره‌های نوع %s به نسخه 1.12 یا بالاتر Sing-Box نیاز دارند.

source: %s type node subscriptions are not currently supported, skip this node.
fa: اشتراک‌های گره نوع %s در حال حاضر پشتیبانی نمی‌شوند، صرف‌نظر از این گره.

source: Update [%s]
fa: به‌روزرسانی [%s]

source: Matching node:
fa: گره منطبق:

source: First Matching node:
fa: اولین گره منطبق:

source: Second Matching node:
fa: دومین گره منطبق:

source: Third Matching node:
fa: سومین گره منطبق:

source: Fourth Matching node:
fa: چهارمین گره منطبق:

source: Fifth Matching node:
fa: پنجمین گره منطبق:

source: Unable to find the best matching node, now replaced with:
fa: عدم توانایی در یافتن بهترین گره منطبق، اکنون جایگزین شده با:

source: Unable to find a new node. Please confirm and process manually.
fa: عدم توانایی در یافتن گره جدید. لطفاً تأیید و به صورت دستی پردازش کنید.

source: No node information updates are available.
fa: هیچ به‌روزرسانی اطلاعات گره در دسترس نیست.

source: Skip unknown types:
fa: صرف‌نظر از انواع ناشناخته:

source: Discard node: %s, Reason:
fa: حذف گره: %s، دلیل:

source: No usable binary was found.
fa: هیچ باینری قابل استفاده‌ای یافت نشد.

source: Discard filter nodes: %s type node %s
fa: حذف گره‌های فیلتر: نوع گره %s %s

source: Parsing error, skip this node.
fa: خطای تجزیه، صرف‌نظر از این گره.

source: Successfully resolved the [%s] node, number: %s
fa: گره [%s] با موفقیت حل شد، تعداد: %s

source: Get subscription content for [%s] is empty. This may be due to an invalid subscription address or a network problem. Please diagnose the issue!
fa: دریافت محتوای اشتراک برای [%s] خالی است. این ممکن است به دلیل آدرس اشتراک نامعتبر یا مشکل شبکه باشد. لطفاً مشکل را بررسی کنید!

source: Proxy
fa: پروکسی

source: Start subscribing...
fa: شروع اشتراک‌گیری...

source: Start subscribing: %s
fa: شروع اشتراک‌گیری: %s

source: Subscription: [%s] No changes, no update required.
fa: اشتراک: [%s] بدون تغییر، نیازی به به‌روزرسانی نیست.

source: [%s] Subscription failed. This could be due to an invalid subscription address or a network issue. Please diagnose the problem! [%s]
fa: [%s] اشتراک ناموفق بود. این می‌تواند به دلیل آدرس اشتراک نامعتبر یا مشکل شبکه باشد. لطفاً مشکل را بررسی کنید! [%s]

source: Error, restoring service.
fa: خطا، بازیابی سرویس.

source: Subscription complete...
fa: اشتراک کامل شد...
