Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall2.po
Languages: fa

source: This variable specifies a directory where geoip.dat and geosite.dat files are.
fa: این متغیر دایرکتوری محل قرارگیری فایل‌های geoip.dat و geosite.dat را مشخص می‌کند.

source: Enable GeoIP Data Parsing
fa: فعال‌سازی تجزیه داده‌های GeoIP

source: Analyzes and preloads GeoIP data to enhance the shunt performance.
fa: داده‌های GeoIP را برای بهبود عملکرد شنت تجزیه و پیش‌بارگذاری می‌کند.

source: Note: Increases resource usage.
fa: توجه: مصرف منابع را افزایش می‌دهد.

source: Shunt Rule
fa: قانون شنت

source: Please note attention to the priority, the higher the order, the higher the priority.
fa: لطفاً به اولویت توجه کنید، هرچه ترتیب بالاتر باشد، اولویت بیشتر است.

source: Update...
fa: به‌روزرسانی...

source: It is the latest version
fa: این آخرین نسخه است

source: Update successful
fa: به‌روزرسانی موفقیت‌آمیز بود

source: Click to update
fa: برای به‌روزرسانی کلیک کنید

source: Updating...
fa: در حال به‌روزرسانی...

source: Retry
fa: تلاش مجدد

source: Unexpected error
fa: خطای غیرمنتظره

source: Updating, are you sure to close?
fa: در حال به‌روزرسانی، آیا مطمئن هستید که ببندید؟

source: Downloading...
fa: در حال دانلود...

source: Unpacking...
fa: در حال استخراج...

source: Moving...
fa: در حال انتقال...

source: App Update
fa: به‌روزرسانی برنامه

source: Please confirm that your firmware supports FPU.
fa: لطفاً تأیید کنید که سیستم‌عامل شما از FPU پشتیبانی می‌کند.

source: if you want to run from memory, change the path, /tmp beginning then save the application and update it manually.
fa: اگر می‌خواهید از حافظه اجرا کنید، مسیر را تغییر دهید، با /tmp شروع شود سپس برنامه را ذخیره و دستی به‌روزرسانی کنید.

source: Make sure there is enough space to install %s
fa: مطمئن شوید که فضای کافی برای نصب %s وجود دارد

source: App Path
fa: مسیر برنامه

source: %s App Path
fa: مسیر برنامه %s

source: %s Client App Path
fa: مسیر برنامه کلاینت %s

source: Node Subscribe
fa: اشتراک گره

source: Subscribe Remark
fa: توضیحات اشتراک

source: Subscribe Info
fa: اطلاعات اشتراک

source: Subscribe URL
fa: URL اشتراک

source: Subscribe URL Access Method
fa: روش دسترسی به URL اشتراک

source: When adding a new subscription, please save and apply before manually subscribing. If you only change the subscription URL, you can subscribe manually, and the system will save it automatically.
fa: هنگام افزودن اشتراک جدید، لطفاً قبل از انجام اشتراک دستی، تنظیمات را ذخیره و اعمال (Save & Apply) کنید. اگر فقط URL اشتراک را تغییر داده‌اید، می‌توانید به صورت دستی مشترک شوید؛ سیستم آن را به طور خودکار ذخیره می‌کند.

source: Please save and apply before manually subscribing.
fa: لطفاً قبل از اشتراک دستی، ذخیره و اعمال کنید.

source: Subscribe URL cannot be empty.
fa: URL اشتراک نمی‌تواند خالی باشد.

source: Subscribe via proxy
fa: اشتراک از طریق پروکسی

source: Enable auto update subscribe
fa: فعال‌سازی به‌روزرسانی خودکار اشتراک

source: Manual subscription
fa: اشتراک دستی

source: Delete All Subscribe Node
fa: حذف همه گره‌های اشتراک

source: Delete the subscribed node
fa: حذف گره مشترک شده

source: Are you sure you want to delete all subscribed nodes?
fa: آیا مطمئن هستید که می‌خواهید همه گره‌های مشترک شده را حذف کنید؟

source: Manual subscription All
fa: اشتراک دستی همه

source: This remark already exists, please change a new remark.
fa: این توضیحات قبلاً وجود دارد، لطفاً توضیحات جدیدی را انتخاب کنید.

source: Remark cannot be empty.
fa: توضیحات نمی‌تواند خالی باشد.

source: URL cannot be empty.
fa: URL نمی‌تواند خالی باشد.

source: Filter keyword Mode
fa: حالت فیلتر کلمه کلیدی

source: Discard List
fa: لیست حذف

source: Keep List
fa: لیست نگهداری

source: Discard List,But Keep List First
fa: لیست حذف، اما ابتدا لیست نگهداری

source: Keep List,But Discard List First
fa: لیست نگهداری، اما ابتدا لیست حذف

source: Use global config
fa: استفاده از پیکربندی سراسری

source: Add
fa: افزودن

source: ACLs
fa: ACLها

source: ACLs is a tools which used to designate specific IP proxy mode.
fa: ACL ابزاری است که برای تعیین حالت پروکسی IP خاص استفاده می‌شود.

source: Example:
fa: مثال:

source: IP range
fa: محدوده IP

source: Source Interface
fa: رابط منبع

source: Use Interface With ACLs
fa: استفاده از رابط با ACLها

source: Remarks
fa: توضیحات

source: Direct List
fa: لیست مستقیم

source: Proxy List
fa: لیست پروکسی

source: Block List
fa: لیست مسدود

source: Lan IP List
fa: لیست IP شبکه داخلی

source: Route Hosts
fa: میزبان‌های مسیر

source: Join the direct hosts list of domain names will not proxy.
fa: نام دامنه‌هایی که به لیست میزبان‌های مستقیم اضافه شده‌اند، پروکسی نخواهند شد.

source: These had been joined ip addresses will not proxy. Please input the ip address or ip address segment,every line can input only one ip address. For example: 192.168.0.0/24 or 223.5.5.5.
fa: آدرس‌های IP وارد شده در این لیست از پروکسی عبور نخواهند کرد. لطفاً آدرس IP یا رنج CIDR را وارد کنید (هر خط یک مورد). مثال: 192.168.0.0/24 یا 223.5.5.5.

source: These had been joined websites will use proxy. Please input the domain names of websites, every line can input only one website domain. For example: google.com.
fa: وب‌سایت‌های وارد شده در این لیست از پروکسی استفاده خواهند کرد. لطفاً نام دامنه وب‌سایت‌ها را وارد کنید، هر خط فقط یک نام دامنه. برای مثال: google.com.

source: These had been joined ip addresses will use proxy. Please input the ip address or ip address segment, every line can input only one ip address. For example: 35.24.0.0/24 or 8.8.4.4.
fa: آدرس‌های IP اضافه شده از پروکسی استفاده خواهند کرد. لطفاً آدرس IP یا بخش آدرس IP را وارد کنید، هر خط فقط یک آدرس IP. برای مثال: 35.24.0.0/24 یا 8.8.4.4.

source: These had been joined websites will be block. Please input the domain names of websites, every line can input only one website domain. For example: twitter.com.
fa: وب‌سایت‌های وارد شده در این لیست مسدود خواهند شد. لطفاً نام دامنه وب‌سایت‌ها را وارد کنید، هر خط فقط یک نام دامنه. برای مثال: twitter.com.

source: The list is the IPv4 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
fa: این لیست، لیست IP شبکه داخلی IPv4 است که نشان‌دهنده IP اتصال مستقیم شبکه داخلی است. اگر به IP شبکه داخلی در لیست پروکسی نیاز دارید، لطفاً آن را از لیست پاک کنید. به طور پیش‌فرض این لیست را تغییر ندهید.

source: The list is the IPv6 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
fa: این لیست، لیست IP شبکه داخلی IPv6 است که نشان‌دهنده IP اتصال مستقیم شبکه داخلی است. اگر به IP شبکه داخلی در لیست پروکسی نیاز دارید، لطفاً آن را از لیست پاک کنید. به طور پیش‌فرض این لیست را تغییر ندهید.

source: Configure routing etc/hosts file, if you don't know what you are doing, please don't change the content.
fa: پیکربندی فایل etc/hosts مسیریابی، اگر نمی‌دانید چه کاری انجام می‌دهید، لطفاً محتوا را تغییر ندهید.

source: These had been joined ip addresses will be block. Please input the ip address or ip address segment, every line can input only one ip address.
fa: آدرس‌های IP وارد شده در این لیست مسدود خواهند شد. لطفاً آدرس IP یا بخش آدرس IP را وارد کنید، هر خط فقط یک آدرس IP.

source: Inbound Tag
fa: برچسب ورودی

source: Transparent proxy
fa: پروکسی شفاف

source: Not valid domain name, please re-enter!
fa: نام دامنه معتبر نیست، لطفاً دوباره وارد کنید!

source: Not valid IP format, please re-enter!
fa: فرمت IP معتبر نیست، لطفاً دوباره وارد کنید!

source: Not valid IPv4 format, please re-enter!
fa: فرمت IPv4 نامعتبر است، لطفاً دوباره وارد کنید!

source: Not valid IPv6 format, please re-enter!
fa: فرمت IPv6 نامعتبر است، لطفاً دوباره وارد کنید!

source: Not true format, please re-enter!
fa: فرمت صحیح نیست، لطفاً دوباره وارد کنید!

source: Plaintext: If this string matches any part of the targeting domain, this rule takes effet. Example: rule 'sina.com' matches targeting domain 'sina.com', 'sina.com.cn' and 'www.sina.com', but not 'sina.cn'.
fa: متن ساده (Plaintext): اگر این رشته با هر بخشی از دامنه هدف مطابقت داشته باشد، این قانون اعمال می‌شود. مثال: قانون 'sina.com' با دامنه هدف 'sina.com'، 'sina.com.cn' و 'www.sina.com' مطابقت دارد، اما با 'sina.cn' خیر.

source: Regular expression: Begining with 'regexp:', the rest is a regular expression. When the regexp matches targeting domain, this rule takes effect. Example: rule 'regexp:\.goo.*\.com$' matches 'www.google.com' and 'fonts.googleapis.com', but not 'google.com'.
fa: عبارت باقاعده (Regular expression): با 'regexp:' شروع می‌شود و بقیه یک عبارت باقاعده است. زمانی که عبارت باقاعده با دامنه هدف مطابقت داشته باشد، این قانون اعمال می‌شود. مثال: قانون 'regexp:\.goo.*\.com$' با 'www.google.com' و 'fonts.googleapis.com' مطابقت دارد، اما با 'google.com' خیر.

source: Subdomain (recommended): Begining with 'domain:' and the rest is a domain. When the targeting domain is exactly the value, or is a subdomain of the value, this rule takes effect. Example: rule 'domain:v2ray.com' matches 'www.v2ray.com', 'v2ray.com', but not 'xv2ray.com'.
fa: زیردامنه (توصیه شده): با 'domain:' شروع می‌شود و بقیه یک دامنه است. زمانی که دامنه هدف دقیقاً مقدار باشد، یا زیردامنه‌ای از مقدار باشد، این قانون اعمال می‌شود. مثال: قانون 'domain:v2ray.com' با 'www.v2ray.com' و 'v2ray.com' مطابقت دارد، اما با 'xv2ray.com' خیر.

source: Full domain: Begining with 'full:' and the rest is a domain. When the targeting domain is exactly the value, the rule takes effect. Example: rule 'domain:v2ray.com' matches 'v2ray.com', but not 'www.v2ray.com'.
fa: دامنه کامل: با 'full:' شروع می‌شود و بقیه یک دامنه است. زمانی که دامنه هدف دقیقاً مقدار باشد، قانون اعمال می‌شود. مثال: قانون 'domain:v2ray.com' با 'v2ray.com' مطابقت دارد، اما با 'www.v2ray.com' خیر.

source: Sing-Box rule-set: Begining with 'rule-set:remote:' or 'rule-set:local:'
fa: مجموعه قوانین Sing-Box: با 'rule-set:remote:' یا 'rule-set:local:' شروع می‌شود

source: Such as:
fa: مانند:

source: Pre-defined domain list: Begining with 'geosite:' and the rest is a name, such as geosite:google or geosite:cn.
fa: لیست دامنه از پیش تعریف شده: با 'geosite:' شروع می‌شود و بقیه یک نام است، مانند geosite:google یا geosite:cn.

source: Annotation: Begining with #
fa: توضیحات: با # شروع می‌شود

source: Invert match result.
fa: معکوس کردن نتیجه تطابق.

source: Only support Sing-Box.
fa: فقط پشتیبانی از Sing-Box.

source: IP: such as '127.0.0.1'.
fa: IP: مانند '127.0.0.1'.

source: CIDR: such as '127.0.0.0/8'.
fa: CIDR: مانند '127.0.0.0/8'.

source: GeoIP: such as 'geoip:cn'. It begins with geoip: (lower case) and followed by two letter of country code.
fa: GeoIP: مانند 'geoip:cn'. با geoip: (حروف کوچک) شروع می‌شود و با دو حرف کد کشور دنبال می‌شود.

source: Clear logs
fa: پاک کردن گزارش‌ها

source: Password
fa: رمز عبور

source: IV Check
fa: بررسی IV

source: UDP over TCP
fa: UDP بر روی TCP

source: Connection Timeout
fa: مهلت زمانی اتصال

source: Local Port
fa: پورت محلی

source: Fast Open
fa: بازگشایی سریع (Fast Open)

source: Pre-connections
fa: پیش‌اتصالات

source: Number of early established connections to reduce latency.
fa: تعداد اتصالات از پیش برقرار شده برای کاهش تاخیر.

source: plugin
fa: افزونه

source: Supports custom SIP003 plugins, Make sure the plugin is installed.
fa: پشتیبانی از افزونه‌های سفارشی SIP003، مطمئن شوید که افزونه نصب شده است.

source: opts
fa: گزینه‌ها (opts)

source: Protocol
fa: پروتکل

source: Protocol_param
fa: پارامتر پروتکل

source: Obfs
fa: مبهم‌سازی (Obfs)

source: Obfs_param
fa: پارامتر مبهم‌سازی

source: Plugin Name
fa: نام افزونه

source: Plugin Arguments
fa: آرگومان‌های افزونه

source: User Level
fa: سطح کاربر

source: Transport
fa: انتقال

source: Public Key
fa: کلید عمومی

source: Private Key
fa: کلید خصوصی

source: Pre shared key
fa: کلید از پیش به اشتراک گذاشته شده

source: Local Address
fa: آدرس محلی

source: System interface
fa: رابط سیستم

source: System interface name
fa: نام رابط سیستم

source: Decimal numbers separated by "," or Base64-encoded strings.
fa: اعداد دهدهی جدا شده با "," یا رشته‌های کدگذاری شده با Base64.

source: Camouflage Domain
fa: دامنه استتار

source: Camouflage Type
fa: نوع استتار

source: Transport Layer Encryption
fa: رمزنگاری لایه انتقال

source: Whether or not transport layer encryption is enabled, "none" for unencrypted, "tls" for using TLS, "xtls" for using XTLS.
fa: اینکه رمزنگاری لایه انتقال فعال باشد یا خیر، "none" برای بدون رمزنگاری، "tls" برای استفاده از TLS، "xtls" برای استفاده از XTLS.

source: Original Trojan only supported 'tls', please choose 'tls'.
fa: Trojan اصلی فقط از 'tls' پشتیبانی می‌کند، لطفاً 'tls' را انتخاب کنید.

source: Transfer mode
fa: حالت انتقال

source: Do not send server name in ClientHello.
fa: نام سرور را در ClientHello ارسال نکن.

source: Domain
fa: دامنه

source: allowInsecure
fa: اجازه ناامن (allowInsecure)

source: Whether unsafe connections are allowed. When checked, Certificate validation will be skipped.
fa: آیا اتصالات ناامن مجاز هستند. در صورت تیک خوردن، اعتبارسنجی گواهی نادیده گرفته می‌شود.

source: %s Node Use Type
fa: نوع استفاده گره %s

source: Set the TUIC proxy server ip address
fa: تنظیم آدرس IP سرور پروکسی TUIC

source: TUIC User Password For Connect Remote Server
fa: رمز عبور کاربر TUIC برای اتصال به سرور راه دور

source: TUIC UserName For Local Socks
fa: نام کاربری TUIC برای Socks محلی

source: TUIC Password For Local Socks
fa: رمز عبور TUIC برای Socks محلی

source: UDP relay mode
fa: حالت بازپخش UDP

source: Congestion control algorithm
fa: الگوریتم کنترل ازدحام

source: Heartbeat interval(second)
fa: بازه ضربان قلب (ثانیه)

source: Timeout for establishing a connection to server(second)
fa: مهلت زمانی برای برقراری اتصال به سرور (ثانیه)

source: Garbage collection interval(second)
fa: بازه جمع‌آوری زباله (ثانیه)

source: Garbage collection lifetime(second)
fa: طول عمر جمع‌آوری زباله (ثانیه)

source: Disable SNI
fa: غیرفعال کردن SNI

source: Enable 0-RTT QUIC handshake
fa: فعال‌سازی دست تکان دادن 0-RTT QUIC

source: TUIC send window
fa: پنجره ارسال TUIC

source: TUIC receive window
fa: پنجره دریافت TUIC

source: TUIC Maximum packet size the socks5 server can receive from external, in bytes
fa: حداکثر اندازه بسته TUIC که سرور socks5 می‌تواند از خارج دریافت کند، به بایت

source: Set if the listening socket should be dual-stack
fa: تنظیم کنید که سوکت شنونده دو پشته‌ای (dual-stack) باشد یا خیر

source: <br />none: default, no masquerade, data sent is packets with no characteristics.<br />srtp: disguised as an SRTP packet, it will be recognized as video call data (such as FaceTime).<br />utp: packets disguised as uTP will be recognized as bittorrent downloaded data.<br />wechat-video: packets disguised as WeChat video calls.<br />dtls: disguised as DTLS 1.2 packet.<br />wireguard: disguised as a WireGuard packet. (not really WireGuard protocol)<br />dns: Disguising traffic as DNS requests.
fa: <br />none: پیش‌فرض، بدون استتار، داده‌های ارسالی بسته‌های بدون مشخصه هستند.<br />srtp: مبدل شده به بسته SRTP، به عنوان داده تماس تصویری (مانند FaceTime) شناخته می‌شود.<br />utp: بسته‌های مبدل شده به uTP به عنوان داده دانلود شده bittorrent شناخته می‌شوند.<br />wechat-video: بسته‌های مبدل شده به تماس‌های تصویری WeChat.<br />dtls: مبدل شده به بسته DTLS 1.2.<br />wireguard: مبدل شده به بسته WireGuard. (نه واقعاً پروتکل WireGuard)<br />dns: پنهان کردن ترافیک به عنوان درخواست‌های DNS.

source: Use it together with the DNS disguised type. You can fill in any domain.
fa: از آن همراه با نوع استتار DNS استفاده کنید. می‌توانید هر دامنه‌ای را وارد کنید.

source: Auth
fa: احراز هویت

source: Socks for authentication
fa: Socks برای احراز هویت

source: Socks protocol authentication, support anonymous and password.
fa: احراز هویت پروتکل Socks، پشتیبانی از ناشناس و رمز عبور.

source: anonymous
fa: ناشناس

source: User Password
fa: رمز عبور کاربر

source: Username and Password must be used together!
fa: نام کاربری و رمز عبور باید با هم استفاده شوند!

source: Prefer firewall tools
fa: ترجیح ابزارهای فایروال

source: Experimental feature. Make sure that your node supports IPv6.
fa: ویژگی آزمایشی. مطمئن شوید که گره شما از IPv6 پشتیبانی می‌کند.

source: Status info
fa: اطلاعات وضعیت

source: Big icon
fa: آیکون بزرگ

source: Show node check
fa: نمایش بررسی گره

source: Show Show IP111
fa: نمایش نمایش IP111

source: Destination protocol
fa: پروتکل مقصد

source: Destination address
fa: آدرس مقصد

source: Destination port
fa: پورت مقصد

source: Whether to receive PROXY protocol, when this node want to be fallback or forwarded by proxy, it must be enable, otherwise it cannot be used.
fa: آیا پروتکل PROXY دریافت شود، زمانی که این گره بخواهد پشتیبان باشد یا توسط پروکسی فوروارد شود، باید فعال باشد، در غیر این صورت قابل استفاده نیست.

source: outbound node
fa: گره خروجی

source: Custom Socks
fa: Socks سفارشی

source: Custom HTTP
fa: HTTP سفارشی

source: Custom Interface
fa: رابط سفارشی

source: Interface
fa: رابط

source: Bind Local
fa: اتصال محلی (Bind Local)

source: When selected, it can only be accessed localhost.
fa: در صورت انتخاب، فقط از طریق localhost قابل دسترسی است.

source: Accept LAN Access
fa: پذیرش دسترسی شبکه داخلی (LAN)

source: When selected, it can accessed lan , this will not be safe!
fa: در صورت انتخاب، از شبکه داخلی (LAN) قابل دسترسی خواهد بود؛ این کار امنیت را کاهش می‌دهد!

source: Enable Remote
fa: فعال‌سازی راه دور

source: You can forward to Nginx/Caddy/V2ray/Xray WebSocket and more.
fa: می‌توانید به Nginx/Caddy/V2ray/Xray WebSocket و موارد دیگر فوروارد کنید.

source: Remote Address
fa: آدرس راه دور

source: Remote Port
fa: پورت راه دور

source: as:
fa: به عنوان:

source: Public key absolute path
fa: مسیر مطلق کلید عمومی

source: Private key absolute path
fa: مسیر مطلق کلید خصوصی

source: Can't find this file!
fa: این فایل پیدا نشد!

source: Public key and Private key path can not be empty!
fa: مسیر کلید عمومی و کلید خصوصی نمی‌تواند خالی باشد!

source: Server-Side
fa: سمت سرور

source: Server Config
fa: پیکربندی سرور

source: Users Manager
fa: مدیریت کاربران

source: Logs
fa: گزارش‌ها (Logs)

source: Log
fa: گزارش (Log)

source: Enable Node Log
fa: فعال‌سازی گزارش گره

source: Log Level
fa: سطح گزارش

source: Not enabled log
fa: گزارش فعال نیست

source: UDP Forward
fa: فوروارد UDP

source: DNS Settings
fa: تنظیمات DNS

source: Null
fa: تهی (Null)

source: You did not fill in the %s path. Please save and apply then update manually.
fa: شما مسیر %s را پر نکرده‌اید. لطفاً ذخیره و اعمال کنید سپس به صورت دستی به‌روزرسانی کنید.

source: Not installed %s, Can't unzip!
fa: %s نصب نشده است، استخراج امکان‌پذیر نیست!

source: Can't determine ARCH, or ARCH not supported.
fa: معماری (ARCH) قابل تشخیص نیست، یا پشتیبانی نمی‌شود.

source: Get remote version info failed.
fa: دریافت اطلاعات نسخه راه دور ناموفق بود.

source: New version found, but failed to get new version download url.
fa: نسخه جدید پیدا شد، اما دریافت URL دانلود نسخه جدید ناموفق بود.

source: Download url is required.
fa: URL دانلود الزامی است.

source: File download failed or timed out: %s
fa: دانلود فایل ناموفق بود یا زمان آن تمام شد: %s

source: File path required.
fa: مسیر فایل الزامی است.

source: %s not enough space.
fa: %s فضای کافی ندارد.

source: Can't find client in file: %s
fa: کلاینت در فایل پیدا نشد: %s

source: Client file is required.
fa: فایل کلاینت الزامی است.

source: The client file is not suitable for current device.
fa: فایل کلاینت برای دستگاه فعلی مناسب نیست.

source: Can't move new file to path: %s
fa: انتقال فایل جدید به مسیر امکان‌پذیر نیست: %s

source: An XHttpObject in JSON format, used for sharing.
fa: یک XHttpObject در فرمت JSON، برای اشتراک‌گذاری استفاده می‌شود.

source: Enable Mux.Cool
fa: فعال‌سازی Mux.Cool

source: Mux concurrency
fa: همزمانی Mux

source: XUDP Mux concurrency
fa: همزمانی XUDP Mux

source: Padding
fa: پدینگ (Padding)

source: Enable early data
fa: فعال‌سازی داده‌های اولیه (Early Data)

source: Early data length
fa: طول داده‌های اولیه

source: Early data header name
fa: نام هدر داده‌های اولیه

source: Recommended value: Sec-WebSocket-Protocol
fa: مقدار پیشنهادی: Sec-WebSocket-Protocol

source: Health check
fa: بررسی سلامت

source: Health check timeout
fa: مهلت زمانی بررسی سلامت

source: Permit without stream
fa: اجازه بدون جریان (stream)

source: Initial Windows Size
fa: اندازه اولیه پنجره

source: Excluded Domains
fa: دامنه‌های استثنا شده

source: If the traffic sniffing result is in this list, the destination address will not be overridden.
fa: اگر نتیجه شنود ترافیک در این لیست باشد، آدرس مقصد بازنویسی نخواهد شد.

source: Buffer Size
fa: اندازه بافر

source: Buffer size for every connection (kB)
fa: اندازه بافر برای هر اتصال (کیلوبایت)

source: Handshake Timeout
fa: مهلت زمانی دست تکان دادن

source: Idle Timeout
fa: مهلت زمانی بیکاری

source: Hop Interval
fa: بازه پرش (Hop)

source: HeartbeatPeriod(second)
fa: دوره ضربان قلب (ثانیه)

source: Override the connection destination address
fa: بازنویسی آدرس مقصد اتصال

source: Override the connection destination address with the sniffed domain.<br />Otherwise use sniffed domain for routing only.<br />If using shunt nodes, configure the domain shunt rules correctly.
fa: بازنویسی آدرس مقصد اتصال با دامنه شنود شده (Sniffed Domain).<br />در غیر این صورت، از دامنه شنود شده فقط برای مسیریابی استفاده می‌شود.<br />اگر از گره‌های شنت (Shunt) استفاده می‌کنید، قوانین مربوطه را به درستی پیکربندی کنید.

source: Override the connection destination address with the sniffed domain.<br />When enabled, traffic will match only by domain, ignoring IP rules.<br />If using shunt nodes, configure the domain shunt rules correctly.
fa: بازنویسی آدرس مقصد اتصال با دامنه شنود شده.<br />زمانی که فعال باشد، ترافیک فقط با دامنه مطابقت داده می‌شود و قوانین IP نادیده گرفته می‌شوند.<br />اگر از گره‌های شنت استفاده می‌کنید، قوانین شنت دامنه را به درستی پیکربندی کنید.

source: Handshake Server
fa: سرور دست تکان دادن

source: Handshake Server Port
fa: پورت سرور دست تکان دادن

source: Protocol parameter. Will waste traffic randomly if enabled.
fa: پارامتر پروتکل. در صورت فعال‌سازی، مقداری ترافیک تصادفی اضافی تولید می‌کند (برای مبهم‌سازی).

source: Protocol parameter. Enable length block encryption.
fa: پارامتر پروتکل. فعال‌سازی رمزنگاری بلوک طول.

source: TLS Chain Fingerprint (SHA256)
fa: اثر انگشت زنجیره TLS (SHA256)

source: Once set, connects only when the server’s chain fingerprint matches.
fa: پس از تنظیم، فقط زمانی متصل می‌شود که اثر انگشت زنجیره سرور مطابقت داشته باشد.

source: TLS Certificate Name (CertName)
fa: نام گواهی TLS (CertName)

source: TLS is used to verify the leaf certificate name.
fa: TLS برای تأیید نام گواهی برگ (Leaf Certificate) استفاده می‌شود.

source: ECH Config
fa: پیکربندی ECH

source: ECH Key
fa: کلید ECH

source: PQ signature schemes
fa: طرح‌های امضای PQ

source: Disable adaptive sizing of TLS records
fa: غیرفعال‌سازی اندازه‌دهی تطبیقی رکوردهای TLS

source: ECH Query Policy
fa: سیاست پرس‌وجوی ECH

source: Controls the policy used when performing DNS queries for ECH configuration.
fa: سیاستی که هنگام انجام پرس‌وجوهای DNS برای پیکربندی ECH استفاده می‌شود را کنترل می‌کند.

source: Enable Multipath TCP, need to be enabled in both server and client configuration.
fa: فعال‌سازی Multipath TCP، باید در تنظیمات سرور و کلاینت فعال باشد.

source: An FinalMaskObject in JSON format, used for sharing.
fa: یک شیء FinalMaskObject با فرمت JSON که برای اشتراک‌گذاری استفاده می‌شود.

source: Fragment
fa: قطعه‌بندی (Fragment)

source: TCP fragments, which can deceive the censorship system in some cases, such as bypassing SNI blacklists.
fa: قطعه‌بندی TCP، که می‌تواند در برخی موارد سیستم سانسور را فریب دهد، مانند دور زدن لیست سیاه SNI.

source: Fragment Packets
fa: بسته‌های قطعه‌بندی شده

source: "1-3" is for segmentation at TCP layer, applying to the beginning 1 to 3 data writes by the client. "tlshello" is for TLS client hello packet fragmentation.
fa: "1-3" برای قطعه‌بندی در لایه TCP است و به 1 تا 3 نوشتن اول داده توسط کلاینت اعمال می‌شود. "tlshello" برای قطعه‌بندی بسته سلام کلاینت TLS است.

source: Fragment Length
fa: طول قطعه
