Repository: kenzok8/small-package
Catalog: luci-app-passwall2/po/*/passwall.po
Languages: ru

source: TLS is used to verify the leaf certificate name.
ru: Используется TLS для проверки имени конечного сертификата.

source: ECH Config
ru: Конфигурация ECH

source: ECH Key
ru: Ключ ECH

source: PQ signature schemes
ru: Схемы постквантовой подписи

source: Disable adaptive sizing of TLS records
ru: Отключить адаптивный размер TLS-записей

source: ECH Query Policy
ru: Политика запросов ECH

source: Controls the policy used when performing DNS queries for ECH configuration.
ru: Управляет политикой DNS-запросов для получения конфигурации ECH.

source: Enable Multipath TCP, need to be enabled in both server and client configuration.
ru: Включить Multipath TCP. Должно быть активировано и на сервере, и на клиенте.

source: An FinalMaskObject in JSON format, used for sharing.
ru: Объект FinalMaskObject в формате JSON, используемый для обмена данными.

source: Fragment
ru: Фрагментация

source: TCP fragments, which can deceive the censorship system in some cases, such as bypassing SNI blacklists.
ru: Фрагментация TCP-пакетов. В некоторых случаях помогает обходить системы цензуры, например, чёрные списки SNI.

source: Fragment Packets
ru: Способ фрагментации

source: "1-3" is for segmentation at TCP layer, applying to the beginning 1 to 3 data writes by the client. "tlshello" is for TLS client hello packet fragmentation.
ru: «1–3» — фрагментация TCP для первых 1–3 отправок данных клиентом. «tlshello» — фрагментация пакета TLS ClientHello.

source: Fragment Length
ru: Длина фрагмента

source: Fragmented packet length (byte)
ru: Длина фрагментированного пакета (байт)

source: Fragment Interval
ru: Интервал фрагментации

source: Fragmentation interval (ms)
ru: Интервал между фрагментами (мс)

source: Max Split
ru: Макс. число фрагментов

source: Limit the maximum number of splits.
ru: Ограничить максимальное количество фрагментов.

source: Split handshake data into multiple TLS records for better censorship evasion. Low overhead. Recommended to enable first.
ru: Разбивать данные рукопожатия на несколько TLS-записей для лучшего обхода цензуры. Малая нагрузка. Рекомендуется включить в первую очередь.

source: Split handshake into multiple TCP segments. Enhances obfuscation. May increase delay. Use only if needed.
ru: Разбивать рукопожатие на несколько TCP-сегментов. Усиливает маскировку. Может увеличить задержку. Использовать только при необходимости.

source: Noise
ru: Шум

source: UDP noise, Under some circumstances it can bypass some UDP based protocol restrictions.
ru: UDP-шум. В некоторых случаях помогает обходить ограничения, наложенные на UDP-протоколы.

source: To send noise packets, select "Noise" in Xray Settings.
ru: Чтобы отправлять шумовые пакеты, включите «Шум» в настройках Xray.

source: Xray Noise Packets
ru: Пакеты шума Xray

source: Packet
ru: Пакет

source: Delay (ms)
ru: Задержка (мс)

source: IP Type
ru: Тип IP

source: If is domain name, The requested domain name will be resolved to IP before connect.
ru: Если указано доменное имя, оно будет разрешено в IP-адрес перед подключением.

source: Chain Proxy
ru: Цепочка прокси

source: Landing Node
ru: Сервер выхода

source: Only support a layer of proxy.
ru: Поддерживается только один уровень цепочки.

source: Chained proxy works only with Xray or Sing-box nodes.<br>You can only use manual or imported nodes as chained nodes.
ru: Цепочка прокси работает только с серверами Xray или Sing-Box.<br>В качестве звеньев цепочки можно использовать только серверы, добавленные вручную или импортированные.

source: Set the default domain resolution strategy for the sing-box node.
ru: Задать стратегию разрешения доменов по умолчанию для сервера Sing-Box.

source: Prefer IPv4
ru: Предпочитать IPv4

source: Prefer IPv6
ru: Предпочитать IPv6

source: IPv4 Only
ru: Только IPv4

source: IPv6 Only
ru: Только IPv6

source: Maintain
ru: Обслуживание

source: Backup and Restore
ru: Резервное копирование

source: Backup or Restore Client and Server Configurations.
ru: Создание или восстановление резервной копии настроек клиента и сервера.

source: Note: Restoring configurations across different versions may cause compatibility issues.
ru: Примечание: восстановление настроек между разными версиями может вызвать проблемы совместимости.

source: Create Backup File
ru: Создать резервную копию

source: Restore Backup File
ru: Восстановить из резервной копии

source: DL Backup
ru: Скачать резервную копию

source: RST Backup
ru: Восстановить из копии

source: Backup failed!
ru: Ошибка создания резервной копии!

source: UL Restore
ru: Загрузить и восстановить

source: CLOSE WIN
ru: Закрыть окно

source: Restore to default configuration
ru: Восстановить настройки по умолчанию

source: Do Reset
ru: Выполнить сброс

source: Please select a file first.
ru: Сначала выберите файл.

source: Invalid file type. Please upload a .tar.gz file.
ru: Недопустимый тип файла. Пожалуйста, загрузите файл .tar.gz.

source: File size exceeds 10MB limit.
ru: Размер файла превышает лимит 10 МБ.

source: Do you want to restore the client to default settings?
ru: Восстановить настройки клиента по умолчанию?

source: Are you sure you want to restore the client to default settings?
ru: Вы действительно хотите восстановить настройки клиента по умолчанию?

source: Configuration file uploaded successfully…
ru: Файл конфигурации успешно загружен…

source: Configuration restored successfully…
ru: Конфигурация успешно восстановлена…

source: Service restarting…
ru: Перезапуск службы…

source: Configuration file decompression failed, please try again!
ru: Ошибка распаковки файла конфигурации, попробуйте ещё раз!

source: URLTest node list
ru: Список серверов для URLTest

source: List of nodes to test, <a target='_blank' href='https://sing-box.sagernet.org/configuration/outbound/urltest'>document</a>
ru: Список серверов для тестирования, <a target='_blank' href='https://sing-box.sagernet.org/zh/configuration/outbound/urltest'>документация</a>

source: Test interval
ru: Интервал тестирования

source: Test interval must be less or equal than idle timeout.
ru: Интервал тестирования не должен превышать тайм-аут простоя.

source: Test tolerance
ru: Допустимая погрешность

source: The test tolerance in milliseconds.
ru: Допустимая погрешность теста в миллисекундах.

source: Idle timeout
ru: Тайм-аут простоя

source: The idle timeout.
ru: Время бездействия до отключения.

source: Interrupt existing connections
ru: Разрывать активные соединения

source: Interrupt existing connections when the selected outbound has changed.
ru: Разрывать существующие соединения при смене выбранного исходящего сервера.

source: Port hopping range
ru: Диапазон смены портов

source: Format as 1000:2000 or 1000-2000 Multiple groups are separated by commas (,).
ru: Формат: 1000:2000 или 1000-2000. Несколько групп разделяются запятой (,).

source: Use Custom Config
ru: Использовать свою конфигурацию

source: Custom Config
ru: Пользовательская конфигурация

source: Must be JSON text!
ru: Должен быть JSON-текст!

source: Geo View
ru: Просмотр Geo

source: Query
ru: Запрос

source: Querying
ru: Идёт запрос...

source: Please enter query content!
ru: Пожалуйста, введите текст запроса!

source: No results were found!
ru: Ничего не найдено!

source: Rules containing this value:
ru: Правила, содержащие это значение:

source: Domain/IP Query
ru: Запрос домена/IP

source: GeoIP/Geosite Query
ru: Запрос GeoIP/Geosite

source: Enter a domain or IP to query the Geo rule list they belong to.
ru: Введите домен или IP, чтобы узнать, в какие Geo-правила они входят.

source: Enter a GeoIP or Geosite to extract the domains/IPs they contain. Format: geoip:cn or geosite:gfw
ru: Введите GeoIP или Geosite, чтобы получить список содержащихся в них доменов/IP. Формат: geoip:cn или geosite:gfw

source: Tips:
ru: Подсказки:

source: By entering a domain or IP, you can query the Geo rule list they belong to.
ru: Введя домен или IP, можно узнать, в какие Geo-правила он входит.

source: By entering a GeoIP or Geosite, you can extract the domains/IPs they contain.
ru: Введя GeoIP или Geosite, можно получить список содержащихся в них доменов/IP.

source: Use the GeoIP/Geosite query function to verify if the entered Geo rules are correct.
ru: Используйте функцию запроса GeoIP/Geosite для проверки корректности введённых Geo-правил.

source: Private Key Passphrase
ru: Парольная фраза приватного ключа

source: Host Key
ru: Ключ хоста

source: Accept any if empty.
ru: Если оставить пустым — принимать любой.

source: Host Key Algorithms
ru: Алгоритмы ключа хоста

source: Client Version
ru: Версия клиента

source: Random version will be used if empty.
ru: Если оставить пустым — будет использована случайная версия.

source: The configured type also applies to the core specified when manually importing nodes.
ru: Выбранный тип также применяется к ядру, указанному при ручном импорте серверов.

source: Group Name
ru: Название группы

source: Reassign Group
ru: Изменить группу

source: Reassign Node Group
ru: Изменить группу сервера

source: Search nodes...
ru: Поиск серверов...

source: Using...
ru: Используется.

source: Generate configuration file and run
ru: Сгенерировать конфигурацию и запустить

source: Start after a delay of %s seconds!
ru: Запуск с задержкой %s секунд!

source: The script is already running, do not run it again. Exit.
ru: Скрипт уже выполняется, повторный запуск отменён.

source: Stop the script and wait for a timeout, then exit without repeating the process.
ru: Остановка скрипта и ожидание тайм-аута, выход без повторного выполнения.

source: Warning: The %s application environment is incomplete. Switch to %s. (%s)
ru: Внимание: среда приложения %s неполная. Переключение на %s. (%s)

source: Note: Dnsmasq (%s) is below 2.90. Upgrading is recommended to improve stability.
ru: Примечание: версия Dnsmasq (%s) ниже 2.90. Рекомендуется обновить для повышения стабильности.

source: Warning: %s transparent proxy is missing basic dependency %s!
ru: Внимание: для прозрачного прокси %s отсутствует базовая зависимость %s!

source: Warning: Not compatible with any transparent proxy system environment.
ru: Внимание: несовместимо ни с одной средой прозрачного прокси.

source: %s does not have execute permissions and cannot be started: %s %s
ru: У %s нет прав на выполнение, запуск невозможен: %s %s

source: %s not found, unable to start...
ru: %s не найден, запуск невозможен...

source: Socks node: [%s]%s is an invalid server address and cannot be started!
ru: SOCKS-сервер: [%s]%s — недопустимый адрес, запуск невозможен!

source: For some reason, the configuration for this Socks service has been lost, and its startup has been aborted!
ru: По неизвестной причине конфигурация этого SOCKS-сервиса утеряна, запуск отменён!

source: Socks node: [%s]%s, start failed %s:%s %s
ru: SOCKS-сервер: [%s]%s, ошибка запуска %s:%s %s

source: Socks node: [%s]%s, starting %s:%s
ru: SOCKS-сервер: [%s]%s, запуск %s:%s

source: To enable experimental IPv6 transparent proxy (TProxy), please ensure your node and type support IPv6!
ru: Для включения экспериментального IPv6-прокси (TProxy) убедитесь, что ваш сервер и тип поддерживают IPv6!

source: [%s] process %s error, skip this transparent proxy!
ru: 【%s】 ошибка процесса %s, этот прозрачный прокси пропускается!

source: Analyzing the node configuration of the Socks service...
ru: Анализ конфигурации сервера для SOCKS-сервиса...

source: Log file is too long, clear it!
ru: Файл журнала слишком большой, выполняется очистка!

source: The task is currently running automatically as a scheduled task; no reconfiguration of the scheduled task is required.
ru: Задача уже выполняется автоматически по расписанию, повторная настройка не требуется.

source: Scheduled tasks: Auto stop service.
ru: Планировщик: автоотключение службы.

source: Scheduled tasks: Auto start service.
ru: Планировщик: автозапуск службы.

source: Scheduled tasks: Auto restart service.
ru: Планировщик: автоперезапуск службы.

source: Scheduled tasks: Auto update rules.
ru: Планировщик: автообновление правил.

source: Scheduled tasks: Auto update [%s] subscription.
ru: Планировщик: автообновление подписки [%s].

source: Auto updates: Starts a cyclical update process.
ru: Автообновление: запуск циклического процесса обновления.

source: Running in no proxy mode, it only allows scheduled tasks for starting and stopping services.
ru: Работа в режиме без прокси: разрешены только задачи автозапуска и автоотключения службы.

source: Clear scheduled commands.
ru: Очистить запланированные команды.

source: Unable to resolve [%s], route table addition failed!
ru: Не удалось разрешить [%s], добавление в таблицу маршрутизации не выполнено!

source: [%s] was successfully added to the routing table of interface [%s]!
ru: [%s] успешно добавлен в таблицу маршрутизации интерфейса [%s]!

source: Adding [%s] to the [%s] routing table failed! The reason is that the [%s] gateway cannot be found.
ru: Добавление [%s] в таблицу маршрутизации [%s] не выполнено! Причина: не найден шлюз [%s].

source: Global nodes are not enabled, skip [%s].
ru: Глобальные серверы не включены, [%s] пропускается.

source: Direct DNS: %s
ru: Прямой DNS: %s

source: Remote DNS: %s
ru: Прокси-DNS: %s

source: The program has started. Please stop it and then restart it!
ru: Программа уже запущена. Пожалуйста, сначала остановите её, затем перезапустите!

source: Running complete!
ru: Выполнение завершено!

source: Clearing and closing related programs and cache complete.
ru: Очистка и завершение связанных процессов и кэша завершена.

source: Incorrect index listing method (%s), execution terminated!
ru: Неверный способ перечисления индексов (%s), выполнение прервано!

source: parse the traffic splitting rules[%s]-[geoip:%s] add to %s to complete.
ru: Разбор правил разделения трафика [%s]-[geoip:%s], добавление в %s завершено.

source: Access Control:
ru: Контроль доступа:

source: Add node to the load balancer is directly connected to %s[%s].
ru: Добавление сервера в балансировщик: прямое подключение к %s[%s] завершено.

source: Add all %s nodes to %s[%s] direct connection complete.
ru: Добавление всех серверов %s в %s[%s]: прямое подключение завершено.

source: Starting to load %s firewall rules...
ru: Начало загрузки правил фаервола %s...

source: local network segments (%s) direct connection: %s
ru: Локальные подсети (%s): прямое подключение: %s

source: Add ISP %s DNS to the whitelist: %s
ru: Добавление DNS провайдера %s в белый список: %s

source: Source iface [%s],
ru: Исходящий интерфейс 【%s】,

source: IP range [%s],
ru: Диапазон IP 【%s】,

source: All device,
ru: Все устройства,

source: Does not exist, ignore.
ru: Не существует, пропущено.

source: not proxy %s port [%s]
ru: не прокси %s порт [%s]

source: not proxy all %s
ru: не прокси все %s

source: Use the %s node [%s]
ru: Использовать %s сервер [%s]

source: Using a node that is different from the global configuration, DNS has been forcibly redirected to a dedicated DNS server.
ru: Используется сервер, отличный от глобальной настройки: DNS принудительно перенаправлен на выделенный DNS-сервер.

source: Add direct DNS to %s: %s
ru: Добавление прямого DNS в %s: %s

source: Local
ru: Локально

source: [Local],
ru: 【Локально】,

source: Clear %s.
ru: Очистка %s.

source: Delete %s rules is complete.
ru: Удаление правил %s завершено.

source: %s firewall rules load complete!
ru: Загрузка правил фаервола %s завершена!

source: Socks switch detection: Unknown error.
ru: Проверка переключения SOCKS: неизвестная ошибка.

source: Socks switch detection: Unable to connect to the network. Please check if the network is working properly!
ru: Проверка переключения SOCKS: не удалось подключиться к сети. Пожалуйста, проверьте работоспособность сети!

source: Socks switch detection: Primary node 【%s: [%s]】 is normal. Switch to the primary node!
ru: Проверка переключения SOCKS: основной сервер 【%s: [%s]】 работает нормально. Переключение на основной сервер!

source: Socks switch detection: %s node switch complete!
ru: Проверка переключения SOCKS: переключение сервера %s завершено!

source: Socks switch detection: %s 【%s:[%s]】 normal.
ru: Проверка переключения SOCKS: %s 【%s:[%s]】 работает нормально.

source: switch to %s test detect!
ru: Переключение на %s для проверки!

source: backup node
ru: резервный сервер

source: next backup node
ru: следующий резервный сервер

source: main node
ru: основной сервер

source: Socks switch detection: %s 【%s:[%s]】 abnormal, %s
ru: Проверка переключения SOCKS: %s 【%s:[%s]】 не работает, %s

source: Socks switch detection: %s 【%s:[%s]】 normal, switch to this node!
ru: Проверка переключения SOCKS: %s 【%s:[%s]】 работает нормально, переключение на этот сервер!

source: Restart dnsmasq service.
ru: Перезапуск службы dnsmasq.

source: Console Port: %s
ru: Порт консоли: %s

source: Discard one obviously invalid node.
ru: Отброшен 1 явно некорректный сервер.

source: Entrance %s:%s
ru: Вход %s:%s

source: Node: %s:%s, Weight: %s
ru: Сервер: %s:%s, вес: %s

source: Start updating the rules...
ru: Начало обновления правил...

source: Download file size verification error. Original file size: %sB. Downloaded file size: %sB.
ru: Ошибка проверки размера файла. Исходный размер: %sB, загруженный: %sB.

source: Downloaded file is empty or an error occurred while reading it.
ru: Загруженный файл пуст или произошла ошибка при чтении.

source: %s Start updating...
ru: %s начало обновления...

source: %s version is the same and does not need to be updated.
ru: Версия %s совпадает, обновление не требуется.

source: %s an error occurred during the file download process. Please try downloading again.
ru: %s ошибка при загрузке файла. Пожалуйста, попробуйте ещё раз.

source: %s an error occurred while downloading the file. Please check your network or the download link and try again!
ru: %s ошибка при загрузке файла. Пожалуйста, проверьте сеть или ссылку и повторите попытку!

source: %s update success.
ru: %s обновлён успешно.

source: %s update failed, please try again later or change URL.
ru: %s обновление не удалось, попробуйте позже или измените URL.

source: %s update error!
ru: %s ошибка обновления!

source: Restart the service and apply the new rules.
ru: Перезапуск службы для применения новых правил.

source: The rules have been updated...
ru: Правила обновлены...

source: Socks node list [%s]
ru: Список SOCKS-серверов [%s]

source: Backup node list
ru: Список резервных серверов

source: HAProxy node list [%s]
ru: Список серверов HAProxy [%s]

source: ACL list [%s]
ru: Список ACL [%s]

source: Shunt [%s] node
ru: Сервер разделения [%s]

source: Xray Load Balancing node [%s] list
ru: Список серверов балансировки Xray [%s]

source: Xray Load Balancing node [%s] backup node
ru: Резервный сервер балансировки Xray [%s]

source: Sing-Box URLTest node [%s] list
ru: Список серверов Sing-Box URLTest [%s]

source: Node [%s] preproxy node
ru: Сервер [%s]: звено цепочки

source: Node [%s] landing node
ru: Сервер [%s]: финальное звено

source: Skipping the %s node is due to incompatibility with the %s core program or incorrect node usage type settings.
ru: Пропуск сервера %s: несовместимость с ядром %s или неверно задан тип использования.

source: Skip node: %s. Because Sing-Box does not support the %s protocol's %s transmission method, Xray needs to be used instead.
ru: Пропуск сервера: %s. Sing-Box не поддерживает метод передачи %s протокола %s, необходимо использовать Xray.

source: Xray unsupport %s plugin.
ru: Xray не поддерживает плагин %s.

source: Plugin options Incomplete.
ru: Опции плагина указаны не полностью.

source: shadowsocks-libev unsupport 2022 encryption.
ru: shadowsocks-libev не поддерживает шифрование 2022.

source: Please replace Xray or Sing-Box to support more transmission methods in Shadowsocks.
ru: Пожалуйста, используйте Xray или Sing-Box для поддержки дополнительных методов передачи в Shadowsocks.

source: unsupport %s plugin.
ru: не поддерживает плагин %s.

source: Skip the %s node because the %s core program is not installed.
ru: Пропуск сервера %s: не установлено ядро %s.

source: Skip the %s node, as %s type nodes require Sing-Box version 1.12 or higher.
ru: Пропуск сервера %s: серверы типа %s требуют Sing-Box версии 1.12 или выше.

source: %s type node subscriptions are not currently supported, skip this node.
ru: Подписки на серверы типа %s пока не поддерживаются, этот сервер пропускается.

source: Update [%s]
ru: Обновление [%s]

source: Matching node:
ru: Найденный сервер:

source: First Matching node:
ru: Первый подходящий сервер:

source: Second Matching node:
ru: Второй подходящий сервер:

source: Third Matching node:
ru: Третий подходящий сервер:

source: Fourth Matching node:
ru: Четвёртый подходящий сервер:

source: Fifth Matching node:
ru: Пятый подходящий сервер:

source: Unable to find the best matching node, now replaced with:
ru: Не удалось найти наилучший сервер, текущая замена:

source: Unable to find a new node. Please confirm and process manually.
ru: Не удалось найти новый сервер. Пожалуйста, проверьте и обработайте вручную.

source: No node information updates are available.
ru: Нет доступных обновлений информации о серверах.

source: Skip unknown types:
ru: Пропуск неизвестных типов:

source: Discard node: %s, Reason:
ru: Отброшен узел: %s, причина:

source: No usable binary was found.
ru: Не найдено пригодного исполняемого файла.

source: Discard filter nodes: %s type node %s
ru: Отброшены узлы фильтра: тип %s, сервер %s

source: Parsing error, skip this node.
ru: Ошибка разбора, этот сервер пропускается.

source: Successfully resolved the [%s] node, number: %s
ru: Успешно разобран [%s], количество узлов: %s

source: Get subscription content for [%s] is empty. This may be due to an invalid subscription address or a network problem. Please diagnose the issue!
ru: Содержимое подписки [%s] пусто. Возможно, адрес подписки неверен или есть проблема с сетью. Пожалуйста, проведите диагностику!

source: Proxy
ru: Прокси

source: Start subscribing...
ru: Начало подписки...

source: Start subscribing: %s
ru: Начало подписки: %s

source: Subscription: [%s] No changes, no update required.
ru: Подписка: [%s] изменений нет, обновление не требуется.

source: [%s] Subscription failed. This could be due to an invalid subscription address or a network issue. Please diagnose the problem! [%s]
ru: [%s] Ошибка подписки. Возможно, адрес подписки неверен или есть проблема с сетью. Пожалуйста, проведите диагностику! [%s]

source: Error, restoring service.
ru: Ошибка, выполняется восстановление службы.

source: Subscription complete...
ru: Подписка завершена...
