Repository: kenzok8/small-package
Catalog: luci-app-iperf/po/*/iperf.po
Languages: de

source: 0 for unlimited. Need to be limited for UDP test
de: für 'unbegrenzt' den Wert '0' setzen. (Muss für UDP-Tests eingeschränkt werden)

source: Bad address specified!
de: Ungültige Adresse!

source: Download
de: Downstream

source: Internet protocol
de: Internet-Protokoll

source: Loading
de: Wird geladen

source: Mode of operation
de: Betriebsart

source: Number of parallel client streams to run
de: Anzahl der parallel zu testenden Verbindungen

source: Omit the first n seconds
de: Die ersten n Sekunden nicht berücksichtigen

source: Settings
de: Einstellungen

source: Target bitrate (Mbits/s)
de: Angestrebte Bandbreite (MBit/s)

source: This iPerf interface is in bêta. No support for this.
de: Diesese Oberfläche für iPerf ist im Beta-Stadium und ohne offiziellen Support.

source: Time to transmit for (s)
de: Übertragungszeit in Sekunden

source: Upload
de: Upstream

source: Waiting for command to complete...
de: Warte auf Abschluss der Aufgaben

source: iPerf speed tests
de: iPerf Geschwindigkeitstests
