Repository: kenzok8/small-package
Catalog: luci-app-argon-config/po/*/argon-config.po
Languages: pt_br

source: 0 transparent - 1 opaque ; ( Suggest: Black translucent preset: 0.5 )
pt_br: 0 transparente - 1 opaco; (Sugestão: preto translúcido predefinido: 0.5)

source: 0 transparent - 1 opaque ; ( Suggest: transparent: 0 or translucent preset: 0.5 )
pt_br: 0 transparente - 1 opaco; (Sugestão: transparente: 0 ou translúcido predefinido: 0.5)

source: A HEX Color ; ( Default: #483d8b )
pt_br: Uma cor HEX; (Padrão: #483d8b)

source: A HEX Color ; ( Default: #5e72e4 )
pt_br: Uma cor HEX; (Padrão: #5e72e4)

source: Argon Config
pt_br: Configuração Argon

source: Background file list
pt_br: Lista de arquivos de fundo

source: Bing Wallpapers
pt_br: Papéis de parede do Bing

source: Built-in
pt_br: Integrado

source: Choose local file:
pt_br: Escolher arquivo local:

source: Create upload file error.
pt_br: Erro ao criar arquivo de upload.

source: File name
pt_br: Nome do arquivo

source: File saved to
pt_br: Arquivo salvo em

source: Follow System
pt_br: Seguir sistema

source: Force Dark
pt_br: Forçar escuro

source: Force Light
pt_br: Forçar claro

source: Grant UCI access for luci-app-argon-config
pt_br: Conceder acesso UCI para luci-app-argon-config

source: Here you can set the blur and transparency of the login page of argon theme, and manage the background pictures and videos.[Chrome is recommended]
pt_br: Aqui você pode configurar o desfoque e a transparência da página de login do tema argon, e gerenciar as imagens de fundo e vídeos. [Recomenda-se o Chrome]

source: Larger value will more blurred ; ( Suggest: clear: 1 or blur preset: 10 )
pt_br: Maior valor será mais desfocado; (Sugestão: claro: 1 ou desfoque predefinido: 10)

source: Modify time
pt_br: Modificar horário

source: No specify upload file.
pt_br: Nenhum arquivo de upload especificado.

source: Remove
pt_br: Remover

source: Save Changes
pt_br: Salvar alterações

source: Size
pt_br: Tamanho

source: Theme mode
pt_br: Modo do tema

source: Upload
pt_br: Carregar

source: Upload (Free:
pt_br: Carregar (Livre:

source: Upload file to '/www/luci-static/argon/background/'
pt_br: Carregar arquivo para '/www/luci-static/argon/background/'

source: Wallpaper Source
pt_br: Fonte do papel de parede

source: You can choose Theme color mode here
pt_br: Você pode escolher o modo de cor do tema aqui

source: You can upload files such as jpg,png,gif,mp4,webm files, To change the login page background.
pt_br: Você pode carregar arquivos como jpg, png, gif, mp4, webm, para mudar o fundo da página de login.

source: [Dark mode] Frosted Glass Radius
pt_br: [Modo escuro] Raio de vidro fosco

source: [Dark mode] Primary Color
pt_br: [Modo escuro] Cor primária

source: [Dark mode] Transparency
pt_br: [Modo escuro] Transparência

source: [Light mode] Frosted Glass Radius
pt_br: [Modo claro] Raio de vidro fosco

source: [Light mode] Primary Color
pt_br: [Modo claro] Cor primária

source: [Light mode] Transparency
pt_br: [Modo claro] Transparência
