Repository: kenzok8/small-package
Catalog: luci-app-mptcp/po/*/mptcp.po
Languages: fr, oc

source: (%d minute window, %d second interval)
fr: (fenêtre de %d minute, intervalle de %d seconde)
oc: (fenèstra de %d minuta,interval de %d segonda)

source: (%d minutes window, %d seconds interval)
fr: (fenêtre de %d minutes, intervalle de %d secondes)
oc: (fenèstra de %d minutas,interval de %d segondas)

source: Average:
fr: Moyenne :
oc: Mejana :

source: Bandwidth
fr: Bande passante
oc: Benda passanta

source: Check if MPTCP between interface and server is working.
fr: Vérifiez si MPTCP entre l'interface et le serveur fonctionne.
oc: Verificar se MPTCP entre l‘interfàcia e lo servidor fonciona.

source: Congestion Control
fr: Contrôle de la congestion
oc: Contraròtle de congestion

source: Consecutive segments that should be sent for round robin
fr: Segments consécutifs à envoyer pour round robin

source: Current:
fr: Actuellement :
oc: Actualament :

source: Default is cubic
fr: La valeur par défaut est cubic

source: Default is fullmesh
fr: La valeur par défaut est fullmesh

source: Download:
fr: Téléchargement :
oc: Telecargament :

source: Error
fr: Erreur

source: Established connections
fr: Connexions établies
oc: Connexions establidas

source: Fill the congestion window on all subflows for round robin
fr: Remplir la fenêtre de congestion de tous les sous-flux pour round robin

source: Fullmesh subflows for each pair of IP addresses
fr: Sous-flux Fullmesh pour chaque paire d'adresses IP
oc: Jos flux Fullmesh per cada parelh d’adreças IP

source: Grant UCI access for luci-app-mptcp
fr: Accorder l'accès UCI pour luci-app-mlvpn

source: If you get "TCPOptionMPTCPCapable [...] Sender's Key" at the end, then MPTCP is supported. If there is a "-TCPOptionMPTCPCapable", then it's blocked.
fr: Si vous obtenez «TCPOptionMPTCPCapable [...] Sender's Key» à la fin, alors MPTCP est pris en charge. Si il y a "-TCPOptionMPTCPCapable", alors il est bloqué.

source: Inbound:
fr: Entrant :
oc: Dintrant :

source: Interfaces Settings
fr: Paramètres des interfaces
oc: Paramètres de las interfàcias

source: Loading
fr: Chargement
oc: Cargament

source: MB/s
fr: Mo/s
oc: Mo/s

source: MPTCP Support Check
fr: Vérification du support MPTCP

source: MPTCP monitoring
fr: Surveillance MPTCP

source: Multipath Debug
fr: Débogage multipath
oc: Desbugatge multipath

source: Multipath TCP SYN retries
fr: Tentatives Multipath TCP SYN
oc: Ensages Multipath TCP SYN

source: Multipath TCP checksum
fr: Somme de contrôle Multipath TCP
oc: Sòma de contraròtle Multipath TCP

source: Multipath TCP path-manager
fr: Gestionnaire de chemins Multipath TCP
oc: Gestionari dels camins Multipath TCP

source: Multipath TCP scheduler
fr: Planificateur Multipath TCP
oc: Planificator Multipath TCP

source: Multipath TCP version
fr: Version de Multipath TCP

source: Networks MPTCP settings. Visit <a href='http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP'>http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP</a> for help.
fr: Paramètres réseaux MPTCP. Visiter <a href='http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP'>http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP</a> pour de l'aide.
oc: Paramètres ret MPTCP. Consulatz <a href='http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP'>http://multipath-tcp.org/pmwiki.php/Users/ConfigureMPTCP</a> per d’ajuda.

source: One interface must be set as master
fr: Une interface doit être configuré en temps que maître
oc: Una interfàcia deu èsser configurada coma principala

source: Outbound:
fr: Sortant :
oc: Sortent :

source: Peak:
fr: Pointe :
oc: Punta :

source: Re-create fullmesh subflows after a timeout
fr: Recréer les sous-flux fullmesh après le délai d'expiration
oc: Tornar crear los jos-flus fullmesh aprèp lo relambi d’expiracion

source: Realtime Traffic
fr: Trafic temps réel
oc: Trafic dirèct

source: Settings
fr: Paramètres
oc: Paramètres

source: Test
fr: Essai
oc: Pròva

source: The number of MPTCP-level retransmission intervals with no traffic and pending outstanding data on a given subflow required to declare it stale
fr: Le nombre d'intervalles de retransmission au niveau de MPTCP sans trafic et en attente de données sur un sous-flux requis pour le déclarer obsolète

source: Upload:
fr: Envoie :
oc: Mandadís :

source: Waiting for command to complete...
fr: En attente de la réponse de la commande...
oc: En espèra d’una responsa de la comanda...

source: backup
fr: remplaçant
oc: subordinat

source: default
fr: Défaut
oc: Defaut

source: disable
fr: Désactive
oc: desactivar

source: disabled
fr: Désactivé
oc: desactivat

source: enable
fr: Active
oc: Activar

source: enabled
fr: Activé
oc: Activat

source: kB/s
fr: Ko/s

source: master
fr: maître
oc: màger

source: ndiffports subflows number
fr: Nombre de sous-flux ndiffports
oc: Nombre de jos-flux ndiffports

source: specifies the maximum number of ADD_ADDR suboptions accepted for each MPTCP connection
fr: spécifie le nombre maximum de sous-options ADD_ADDR acceptées pour chaque connexion MPTCP

source: specifies the maximum number of additional subflows allowed for each MPTCP connection
fr: spécifie le nombre maximum de sous-flux ADD_ADDR acceptées pour chaque connexion MPTCP

source: Interface
oc: Interfàcia

source: Netlink
oc: Ligam ret
